[{
  "_id": {
    "$oid": "6026ebaadc848b001718b51a"
  },
  "Title": "Test 1 ",
  "Content": "Some content",
  "published_at": null,
  "createdAt": {
    "$date": "2021-02-12T20:57:14.263Z"
  },
  "updatedAt": {
    "$date": "2021-04-26T23:48:30.688Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "6026eb5ddc848b001718b518"
  },
  "updated_by": {
    "$oid": "6026eb5ddc848b001718b518"
  },
  "image": {
    "$oid": "6087514ae99b5d0017d9725b"
  },
  "metas": [],
  "category": {
    "$oid": "608c202fe2432a001724efda"
  }
},{
  "_id": {
    "$oid": "603ae8dbd02d220017b03ab1"
  },
  "metas": [],
  "Title": "Obtaining a Federal Tax EIN for a Rental Business",
  "Content": "If you have decided to hold your rental properties through a separate business entity, whether its an LLC, C Corp, Sole Proprietorship or another legal entity, you are going to need to apply for and obtain a Employer Identification Number or EIN from the Internal Revenue Service.\n\n\n## What is an Employer Identification Number or EIN?\n\nThe Employer Identification Number or EIN is an original and unique nine-digit number assigned by the Internal Revenue Service. The EIN is issued to business entities operating in the United States of America. EIN’s are utilized by businesses for various government related obligations and interactions. \n\nPlease note that the EIN is also sometimes referred to as the Federal Employer Identification Number or the Federal Tax Identification Number.\n\n![IRS logo.jpg](/uploads/IRS_logo_180dfd9939.jpg)\n\n## How is an EIN used?\n\nAn EIN is used for:\n\n1. Federal Tax obligations\n2. State and Local Tax obligations\n3. Employee obligations\n4. To identify the company with vendors like banks\n\n\nMany vendors and people you want to do business with as well as government agencies will ask for a company’s EIN before doing business with them or assisting them in any way.\n\n\n## Am I required to have an EIN?\n\nIf your business earns income, you will need to pay taxes on it and to do that you need an EIN. So, yes, you do need an EIN to be an operating company that earns money.\n\nIf you want to open a bank account or a stock trading account for your company, the bank is going to ask for your EIN number. \n\nYou’ll quickly find that doing business is a lot harder without an EIN than it is with in fact there are some activities you simply won’t be able to do.\n\nIf your organization qualifies as a tax exempt organization then an EIN may not be needed. \n\n## Where can I apply for an obtain and EIN?\n\n\nThe “apply” aspect of getting an EIN is a bit misleading as so long as you meet their requirements which are pretty basic you will be given an EIN.\n\n1. If your principal business is located in the United States or U.S. Territories you may apply for an EIN.\n2. You must have a Taxpayer Identification Number (SSN, ITIN, EIN) in order to apply.\n3. You are allowed only one new EIN a day.\n\nThe Internal Revenue Service (IRS) has an online application process for obtaining an EIN and you can get it very quickly. ",
  "Date": "2021-02-27",
  "published_at": {
    "$date": "2021-02-28T00:50:46.181Z"
  },
  "createdAt": {
    "$date": "2021-02-28T00:50:35.304Z"
  },
  "updatedAt": {
    "$date": "2021-04-03T19:28:46.823Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c202fe2432a001724efda"
  }
},{
  "_id": {
    "$oid": "604e716b00b7c20017b91068"
  },
  "metas": [],
  "Title": "Transferring Your Rental Properties to an LLC",
  "Content": "If you currently own a rental property or rental properties as an individual and are looking to transfer the property or properties to a limited liability company then read one. digpads assembled this short article to outline the reasons one would want to transfer rental properties to an LLC that they control and how to achieve this. \n<br>\n<br>\n\n\n## **Why transfer a rental property into an LLC?**\n<br>\n<br>\n\n\n**1) Limiting personal liability.** One of the purposes of a limited liability company is to do what the name implies, limit liability. If a rental property is held in an LLC then the liability to the landlord is limited to the value of all assets held within the LLC entity. This means a tenant or other entity or person may not come after your personal assets via legal means, they are limited to the assets held by the LLC.\n<br>\n<br>\n\n**2) Tax Efficiency.** Everyone’s taxes are different and unique but LLC’s are favorable as a “pass through” entity as they avoid double taxation. They are effectively like owning a sole proprietorship business, with better protections, and income that flows directly to the LLC’s owner without going through a corporate structure that must pay taxes itself. There are additional, more complicated tax advantages to having your rental property held in an LLC that digpads recommends speaking to your tax advisor about. \n<br>\n<br>\n\n**3) Organization Purposes.** LLC’s allow for a very flexible corporate organizational structure that can be adapted to a landlord’s needs. For example, LLC’s can accept and shed new members a lot easier than C corporations can. They can also be used as acquisition or holding companies which can be advantageous when structuring corporate investment schemes.\n<br>\n<br>\n\n**4) Aggregation for a Sale.** An LLC allows a landlord to aggregate and acquire rental properties into one legal entity for an easier bulk sale to another landlord or property management group when and if desired. This is a lot easier than having to sell off every single rental property a landlord has aggregated over the years. \n<br>\n<br>\n\n## **What are the steps to transfer a rental property into an LLC?**\n<br>\n<br>\n\n\n1) Form a limited liability corporation (LLC) to acquire the asset from you personally. In most states you can do this online       at the Secretary of State’s website. You’ll need to select a name that is not taken and typically pay a fee. If you already have the LLC established, skip this step. \n<br>\n<br>\n\n2) Acquire an EIN number from the Treasury. You will need to acquire an EIN from the IRS website here. Please note that EIN’s are not something you have to pay for and service providers who offer this service for a free are not something you must pay for. It’s called an EIN application but unless you owe the IRS a lot of money I have never heard of them rejecting anyone who applies. If you already have an EIN, disregard this step and go to Step 3.\n<br>\n<br>\n\n3) Obtain a Deed Transfer Legal Agreement Template. These can typically be found online for each State for free with some good Google search skills. Once you obtain it you’ll want it in a format that allows you to enter your specific details, either a PDF or a WORD document should do.\n<br>\n<br>\n\n4) Call the local county. Most property transfers are handled by the local county recorder’s office. To ensure you have the right information on what needs to be done to satisfy the county, call them and ask or drop into their office.\n<br>\n<br>\n\n5) Fill out the new deed. Utilizing the deed template, fill out the deed with the seller (you) and the buyer (the LLC). Be sure to get the legal property description 100% correct as this is required for a county recorder to accept the transfer document. \n<br>\n<br>\n\n6) Sign the deed in front of a notary. In most counties, a third party is required to be a witness of the signing of the deed transferring the real property to a new person or entity. Notaries are commonly found at your local bank and are offered free of charge at some banks. You will want to refrain from signing the deed until you are with the notary. \n<br>\n\n7) File the new deed with the county. When you have signed the deed in the presence of a notary, take the deed to the county recorder’s office and file it with the county. Most counties charge a flat fee per page for recording the deed.\n<br>\n\nLandlords may always seek help from the local county recorded clerks who are typically happy to help. \n",
  "published_at": {
    "$date": "2021-03-14T20:26:36.289Z"
  },
  "createdAt": {
    "$date": "2021-03-14T20:26:19.174Z"
  },
  "updatedAt": {
    "$date": "2021-03-14T20:26:36.304Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "Date": "2021-03-14",
  "category": {
    "$oid": "608c204ce2432a001724efdb"
  }
},{
  "_id": {
    "$oid": "604e8cfb6cdf0c00175a14ae"
  },
  "metas": [],
  "Title": "Renting to a Covid-19 Era Evicted Tenant",
  "Content": "## **Suggestions for the Independent Landlord on Considering Leasing to a Covid 19 Evicted Tenants**\n<br>\n<br>\n\nIn late 2019 a virus was identified that caused so much fear of death and damage to human health that most of the United States was shut down by local and state governments by late winter or early spring of 2020. This affected larger cities more than rural areas. The CARES ACT, signed on March 27th, was the first legislation that halted evictions for unpaid rent for 120 days. \n<br>\n<br>\nOn September 4th, 2020, the United States Center for Disease Control (CDC) issued a subsequent moratorium on eviction of tenants for unpaid rent that expired on December 31st, 2020 but was extended until March 31st, 2021.  In addition to this law and regulation, many states and local municipalities passed laws banning eviction of tenants for unpaid rent as well. In many of these cases the tenants must be under a certain income threshold to qualify but not in all cases.\n<br>\n<br>\nWhile well intending, these orders created a host of legal, financial and other problems for landlords and in many cases tenants as well. As the bans started to expire, some were extended and some were allowed to lapse. Regardless of what the timing was or is in your local area, eventually a massive amount of evictions occurred or will occur in nearly every city and town of note in the United States. \n<br>\n<br>\nWith so many tenants evicted in such a relatively short period of time around a major event, digpads took a look at how independent landlords should think about renting to tenants evicted by landlords as a result of the Covid 19 declared pandemic.\n<br>\n<br>\n**Massive Economic Disruptions as a Result of Covid 19**\n<br>\n<br>\nPrior to the 2020 appearance of Covid 19 on the United States of America’s shores, unemployment was at record low rates. As of August 15th, 2020, it was estimated that over 21.1 million Americans were unemployed as a result of the virus. Much of the damage affected retail and restaurant workers, those that are most likely to be renters and unable to make up income losses through savings. \n<br>\n<br>\nThe economic fallout from the virus causes almost 100k small businesses to close as of September 2020 and small businesses are the lifeblood of the U.S. economy. These companies going out of business meant less jobs for the workforce and more time it would take to rebound from the economic damage the virus caused to the economy.\n<br>\n<br>\nThis damage hurt a lot of independent landlords, corporate landlords, and property managers of all sizes, primarily due to lost or delayed rent payments. \n<br>\n<br>\n\n**Closest Comparison is the 2008 Mortgage and Financial Crisis**\n<br>\n<br>\nBefore we take a look at how digpads recommends an independent landlord should think about renting to any tenant that was evicted during the Covid 19 crisis, it's important to look at its closest comparable which was the 2008 Mortgage and Financial Crisis. The best estimate for job loss as a result of the 2008 “Great Recession” was 8.2 million. While it is hard to say precisely which foreclosures were tied to this job loss, it was estimated that 3.8 million homes were foreclosed on between 2007 and 2010, an astounding number. \n<br>\n<br>\nWhy is this event similar to Covid? Because it caused massive systemic damage to the economy that resulted in a massive amount of job loss and foreclosed homes as result. While this affected homeowners more than renters, digpads feels that the way a homeowner of a foreclosed home as thought of a few years later is a good model for how to think of a tenant that was evicted during the Covid 19 era. Yes, they are not perfect comparisons, but if you have another modern pandemic that fits perfectly to compare against, we’d be happy to use that instead!\n<br>\n<br>\nHomeowners that lost their homes around the 2008 mortgage crisis and economic recession that followed did see a larger hit to their credit report and credit score that lasted for some time. That being said, credit bureaus, lenders and others involved in assessing if a former homeowner was credible enough to give a loan to were fairly lenient to homeowners if they determined the foreclosure on their report happened anytime around 2008 or in connection with the crisis. \n<br>\n<br>\nWhen an “act of God” like event occurs where average folks are disproportionately hit compared to normal time periods, it may make sense to take that into account when assessing a prospective tenant. What you really want to determine is whether the tenant was really in dire circumstances and could not pay the rent or whether they took advantage of the situation and simply chose to play the system to not pay rent. \n<br>\n<br>\n\n**The Covid-19 Economically Disadvantaged Tenant Vs. The Covid-19 Take-Advantage Tenant**\n<br>\n<br>\nYour goal as an independent landlord is to rent your properties to good tenants and receive monthly rent in exchange for allowing them to live in the property. In order to maximize this goal, you have to make sure you get good tenants in your rental properties. While you should consider rare events that caused massive evictions among tenants, you should also make sure that any prospective tenant you are considering did not take advantage of the situation. While it's likely not as simple for any prospective tenant to fit perfectly in the two buckets listed below and most prospective tenants are likely a range between the two, there are generally two types of tenants that were evicted as a result of Covid-19 moratoriums on evictions.\n<br>\n<br>\n<u>The Typical Characteristics of the Economically Disadvantaged Tenant</u>\n<br>\n<br>\n1. Paid rent on time and in full prior to the Covid-19 pandemic\n<br>\n<br>\n2. Lost job or had income issues due to Covid-19\n<br>\n<br>\n3. Communicated the situation to the landlord and tried to work on a solution\n<br>\n<br>\n\n4. Was not able to make the rent up in time or solve the issue so was evicted\n<br>\n<br>\n\n\n<u>The Typical Characteristics of the Take-Advantage Covid-19 Tenant</u>\n<br>\n<br>\n1. Was a problem tenant before Covid-19; did not pay rent on time and in full and/or was in violation of lease terms\n<br>\n<br>\n2. Did not inform the landlord or attempt to work with them when lost a job or never lost a job\n<br>\n<br>\n3. Made no attempt whatsoever to pay the rent later\n<br>\n<br>\n4. Has other issues or patterns on a tenant screening report that could lead to a rejection on its own\n<br>\n<br>\nAs stated above, no prospective tenant is going to match the characteristics of the two types of Covid-19 evicted tenants. This list of characteristics is meant to help guide you in your decision making. The next step is to ask a lot of questions.\n<br>\n<br>\n**Ask a Lot of Questions - Including on Your Lease Application**\n<br>\n<br>\nSo how do you as an independent landlord determine which type of prospective tenant you are dealing with? First, consider adding the following question to your Leasing Application after a question about evictions:\n<br>\n<br>\nIf you answered yes to the eviction question, was your eviction related to the Covid 19 pandemic? If so, please explain the circumstances that led to your eviction here.\n<br>\n<br>\nLeave a space for the prospective tenant to write in the story below this space.\n<br>\n<br>\nIf everything else checks out with the prospective tenant and you would rent to them barring any issues with the eviction, have a call with the tenant and ask the following questions:\n<br>\n<br>\n1. Tell me the story about your eviction that is related to the Covid 19 pandemic.\n\n                The goal here is to see if any part of the story does not line up with what was written on the lease application. If    \n                there are any material discrepancies, ask further questions.\n\n\n2. What was your income at the time and what was your monthly rent?\n\n\t        You are trying to assess here if the tenant could afford their rent on their income with their\n \t        expenses before the pandemic hit.\n\n3. Did you contact the landlord that evicted you when you lost your job or income or when you saw your income go down?\n\n                The goal of this question is to see if the tenant communicated with and tried to work with the landlord or simply\n                ignored them and used the moratorium to their advantage.\n\n4. Did you receive any unemployment during that time period before eviction or the stimulus check?\n\n                 What you are trying to determine here is if the tenant received income from the government. It is    \n                 helpful information for the question (5) below. Note the time period when the stimulus checks were\n                 sent out and received and the period between the middle of March and the end of July when\n                 unemployment checks had $600 added to each unemployment check from the federal government.\n                 This is all to help you assess if the tenant could have paid the landlord some or all of the rent.\n\n\n5. Did you or anyone you lived with receive any income during the time period from when the moratorium started and when you were evicted?\n\n\t         This is meant to gauge what the finances of the prospective tenant were during the time period of\n \t         the moratorium before they were evicted. It helps you assess if they COULD have paid the\n \t         landlord some or all of the rent and chose not to.\n\n\n6. Did you pay the landlord any of the rent owed since the moratorium period started up until when you were evicted?\n\n        \tYou have to be reasonable here but run the numbers based on the information you were provided.\n \t        Was the tenant actually doing great with unemployment and the stimulus check and simply chose\n \t        to stiff the landlord or were they actually struggling? With the answers to this and all the above\n \t        questions combined with the lease application, you should get a general idea of the type of\n \t        prospective tenant you dealing with.\n\n\n7. Do you think it’s fair that the landlord that evicted you did not get paid?\n\n\t        This question is meant to see what the prospective tenant says to understand their moral\n \t        compass. If they don’t at the very least lie to you and tell you that the landlord deserved the rent as\n \t        a contract was in place and/or it is their property and that is the deal, this likely is not a good tenant\n \t        for you. You should not expect a pro-landlord response here, but anything self-righteous or hateful\n \t        towards their previously landlord that makes them a victim and is incapable of seeing the landlord’s\n \t        side is likely a “Covid-19 Take-Advantage Tenant”.\n<br>\n<br>\nDo not accuse the tenant of being dishonest to you as it isn’t going to go anywhere. A snake doesn’t care if you dislike what it does, it's a snake. Simply tell the tenant you will get back to them shortly and then inform them they were rejected due to the eviction and concerns around that. \n<br>\n<br>\n\n**Run Tenant Screening Checks on the Prospective Tenant**\n\n\n<br>\n<br>\nAfter having the prospective tenant with a Covid-19 eviction address your concerns on their leasing application and on a call with you, it’s wise to also run a tenant screening check on the tenant. For the Covid-19 evicted prospective tenant, you'll want to run all the major tenant screening checks including criminal background check, credit report and score check, eviction report and even an income verification or bank statement report (or request from the tenant). \n<br>\n<br>\nWhile tenant screening is always wise and recommended by digpads, it’s especially important for a Covid-19 evicted tenant if you are trying to access the type of eviction they were (i.e. a Covid-19 Economically Disadvantaged Tenant or a Covid-19 Take-Advantage Tenant as outlined above). The information from these reports can be cross referenced against the information provided to you by the prospective tenant to check for honesty and accuracy in the information provided to you. This will help you understand if the prospective tenant was unable to pay the landlord that evicted him or her for nonpayment of rent or if the prospective tenant chose to use the moratorium due to Covid-19 as an excuse to not do so.\n<br>\n<br>\n\n**Each Prospective Tenant Situation Is Different - It’s Up to You, the Landlord**\n<br>\n<br>\nThe Covid-19 pandemic was a very difficult time period for most people, but especially for tenants who lost their jobs or income during the pandemic. While you should proceed with caution considering a prospective tenant that was evicted around the Covid-19 time period, remember that a lot of generally good people had their lives turned upside down as a result of the pandemic. \n<br>\n<br>\nRemember that each prospective tenant situation is uniquely different and you can’t make broad generalizations about a tenant without verifying by asking them. It generally becomes apparent with all but the best liars and manipulators that something is not adding up the more questions you ask. \n<br>\n<br>\nThe law is very clear in most localities that an eviction or a poor credit report/credit score issues are a legally defensible reason to reject a prospective tenant applicant. Sometimes it makes sense to make exceptions though and sometimes the very best tenants had challenges in their life that on paper make them look like bad tenants but like all of us they simply were going through difficult time periods. Deciding whether or not to lease to a tenant is not normally a simple black or white issue and so like a judge, you must weigh the pros and the cons in making the decision. \n\n",
  "published_at": {
    "$date": "2021-03-17T15:56:47.982Z"
  },
  "createdAt": {
    "$date": "2021-03-14T22:23:55.389Z"
  },
  "updatedAt": {
    "$date": "2021-03-17T19:07:26.309Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "Date": "2021-03-18",
  "category": {
    "$oid": "608c207be2432a001724efdc"
  }
},{
  "_id": {
    "$oid": "605237d639996f0017757496"
  },
  "metas": [],
  "Content": "## **How to Evict a Tenant using the Eviction Process**\n<br>\nThe prospects of a tenant eviction is nothing any landlord looks forward to. The hassle, the cost, the missed income during the process, and the general displeasure of the situation often makes eviction the last route for most landlords. Independent landlords are at a specific disadvantage in this process given lack of access to top-notch attorneys, resources, and in many cases knowledge. <br><br>\nRegardless of these frustrations, in some instances an eviction is an independent landlord's only choice. You are running a business and difficult decisions need to be made to keep that business operating and growing.\ndigpads can't help with all of this, but we can provide the basic information to allow you, the independent landlord, to utilize the eviction process properly when necessary.\n<br><br>\n\n**Eviction Laws Differ From State to State**\n<br><br>\n\nOne of the most important things to know regarding eviction law is that laws vary from state to state. Each state has different requirements for removing a tenant from your property. The good news is that each state does have a process for evicting the tenant as governed by State Law .\n<br><br>digpads recommends checking out our Eviction Laws by State resource as well to familiarize yourself with local eviction laws that affect the tenant's rights and your rights as a landlord.\nAs a general rule, the more Democrat leaning States have tighter regulations focused more on tenant rights. The more Republican leaning States have looser regulations focused more on the landlord's rights. digpads recommends that you review our What Not to do in an Eviction section as well.\n<br><br>\n**Eviction Law Commonalities in All States**\n<br><br>\nNow that we've sufficiently scared you into proceeding cautiously about evicting a tenant, let's review what the general process is for evicting a tenant nationwide:\n\n**1) A Landlord must have a Legitimate Cause for Eviction.**\nAn independent landlord does not want to evict a tenant without a valid reason. This is a great way to find yourself as the defendant and not the plaintiff in the courts. Valid reasons for eviction include:\n<li>Failing to pay rent and/or failure to pay due rent from previous periods (months)\n<li>Violating terms of the lease or rental agreement (examples include unauthorized pets, subletting, illegal uses, etc.)\n<li>Causing material damage to a rental property\n<li>Breaking noise, occupancy, or health ordinances as established by local governments\n<li>Health or safety hazards caused by the tenant that put the tenant or landlord in legal jeopardy\n<br><br>\nEnsure that you are adhering to the State requirements for eviction as each state requires different conditions for eviction. You must receive a court order through eviction proceedings to legally remove a problem tenant.\n<br><br>\n\n**2) Providing an Official Notice of Eviction.** It is important to ensure that you follow all necessary steps as laid out by State law. digpads provides a list of helpful Eviction Law Resources by State to help you know where to go to ensure your adherence to the law. <br><br>\nIt's important to know that eviction laws can be very local (by city). If your property is within a heavily regulated local area like New York City or San Francisco, you'll likely want to check on local eviction laws as well.\nYou want to make sure you provide documentation of everything and have irrefutable proof of all claims.  One of the more critical steps is to provide a sufficient “notice of eviction.” This can be a simple document or form that tells your tenant why they’re being evicted, and what they can do to avoid that eviction.\nIt's important to get the eviction notice correct. <br><br>You'll want to ensure you do the following with the eviction notice:\n<li>List a specific date for the tenant to pay the rent due or move out\n<li>List the amount owed (including all fees)\n<li>Post the notice within the required number of days before filing the eviction paperwork with your local court\n<li>Attach the document to the tenant's front door, and also send it via certified mail or Return Receipt Requested with the United States Postal Service (USPS)\n<br><br>\nMany states provide a state-specific eviction form template that a landlord can utilize to ensure they are in compliance.\n\nIf you've followed this advice and checked on your state and local laws, this should signal to the tenant that you are serious and knowledgeable about this process. <br><br> Hopefully the tenant resolves the situation but if not you must within the set amount of time, usually a week in most areas, file the eviction with the court. In some States, providing notice is also considered terminating the lease by the landlord.\n<br><br>\n**3) File an Eviction with the Local Court.**\nYou'll want to make sure you are filing in the proper court, it's normally the most locally focused court in your area, often called Circuit Courts in larger metropolitan areas. Most local governments will provide details on where to file on their websites. You'll need to ensure these things when filing with a court:<br><br>\n<li>Pay the court's eviction process fee first. The court clerk will then schedule a hearing on the case and will notify the tenant via a summons. Note: it should be easy to deliver the summons as you know where the tenant is living.\n<li>You’ll want to have proof that you gave the written notice with the amount of time your state or local municipality requires. A certified mail receipt should be sufficient for a court.\n<br><br>\n\nPlease note that local courts tend to receive a lot of eviction cases so they may be backed up depending on recent events. Covid 19, for example, and the moratoriums on evictions caused a lot of backups for landlords looking to evict tenants not paying rent.\n<br><br>\n**4) Preparation for Court Hearing & The Court Hearing.** Collect all the documentation you'll need to prove your case. It's better to be over prepared than under prepared. While you should bring any and all documents related to the case to court, be sure to bring the following:\n<br><br>\n<li>Lease agreements between the landlord and the tenant\n<li>Any records of payments not going through (ex. bounced checks)\n<li>Records of payment of any kind throughout the course of the lease\n<li>Records of the communication between you as the landlord and your tenant (written, telephone or email)\n<li>A copy of the written notice you provided your tenant as mentioned above\n<li>Dated proof that the tenant received the notice posted. A signature from the tenant or receipt from the post office of delivery to the tenant are examples of this.\n<br><br>\nA common defense claim by a tenant is that a landlord did not properly inform them of the eviction. Be prepared to disprove this claim if it is made.\n<br><br>Make sure you put your court date on the calendar and attend it on time! Be clear, confident, honest and transparent with the judge and let the document and evidence speak for itself. Do not get emotional or make personal attacks on the tenant during the hearing. Remain professional at all points of a court hearing.\n<br><br>\n\n**5) Actual Tenant Eviction (Finally).** If the court grants you an eviction. the tenant will have a set time period in which they must permanently move out the rental unit. This set time period could range from two to seven days, depending on the state your rental unit is in.<br><br>\nIf your tenant doesn’t leave by the deadline established by the court, you have the legal right to involve the local sheriff's department. The sheriff’s department will assist you in escorting the tenant out and removing their possessions from your property. Please note that there is often an additional fee for utilizing sheriff department resources for evictions.\n<br><br>\nNext, consider how you'll Collect Past Due Rent from an Evicted Tenant. One way to avoid any complexities with evictions is to ensure you have the proper legal forms. Companies like Rocket Lawyer can be of assistance on this.",
  "Title": "Eviction Law and Process for Landlords",
  "published_at": {
    "$date": "2021-03-18T00:51:27.445Z"
  },
  "createdAt": {
    "$date": "2021-03-17T17:09:43.175Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T00:51:27.463Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c208ae2432a001724efdd"
  }
},{
  "_id": {
    "$oid": "60524a7d39996f0017757497"
  },
  "metas": [],
  "Title": "How to Avoid Eviction Mistakes for Landlords",
  "Content": "Landlords and tenant relations are governed by lease agreements and federal, state, and local laws. While property management is a rewarding business, every independent landlord eventually is forced to initiate eviction against a problem tenant. Independent landlords can find themselves in a large legal battle that will cost them a lot of money if they attempt to take action on their own without going through the court system.\n<br><br>\nThe most common eviction reasons include unpaid rent and property damage, typically violations of the lease agreement. Tenant screening can help a landlord reduce the odds of needing to launch eviction proceedings and a security deposit can help a landlord make up for some loses from tenants who won't pay the rent or damage the property. digpads took a look at the common mistakes most landlords make when dealing with problem tenants.\nIt’s important to understand that just because a tenant has violated a lease or rental agreement, that doesn’t mean you can violate any of their other rights or break any laws. Please consider the answers to the below questions before taking the law into your own hands.\n<br><br>\n**Can I remove a tenant’s personal property from my rental property?**\n<br><br>\nWithout an eviction order (or unlawful detainer order) from a court in the jurisdiction of the rental property, you may not remove a tenant’s personal property from your rental unit for any violation of the terms of the lease.\nDoing so runs the risk of legal action being taken against you or your company which can range from trespassing, theft or burglary. Civil and criminal lawsuits may be filed against you for removing a tenant’s personal property from your rental property. The local sheriff may take this action once you obtain an unlawful detainer or eviction order from a judge in your local court.\n\nThere are a small number of States that allow a version of \"self-eviction\" but an extreme degree of caution is warranted if a landlord proceeds with this method of eviction as a lawsuit against the landlord is still very possible if a landlord \"self evicts\" a tenant.\n<br><br>\n**Can I use force or threats of force to remove a tenant?**\n<br><br>\nYou may not use force or threats of force to remove a tenant from your rental property. Any force or threats of force must come from a sheriff’s office once an unlawful detainer or eviction order has been issued by a local court against the tenant.\n<br><br>\nIf you, the independent landlord, decide to threaten or hurt the tenant to leave the rental property, criminal or civil lawsuits may be filed against your or your company. The best course of action is to obtain an unlawful detainer or eviction order from a local judge and then obtain the assistance of the local sheriff to remove a problem tenant. \n<br><br>\n**Can I lock out a tenant or change the locks on the doors to my rental property?**\n<br><br>\nYou may not lock out a tenant or change the locks to the doors to your rental property to keep a tenant that is not abiding by the terms of the lease out of your rental property. The tenant has a legal right to the property once they take possession of it so you must utilize the courts and obtain an unlawful detainer or eviction order in order to take any of these actions.\n<br><br>\n\n**Can I turn off utilities to my rental property?**\n<br><br>\nAll states require that a rental property have modern utilities such as water, electricity, heating, etc. and not providing these to a tenant would be a violation of local and state laws. Even though a tenant has abandoned his responsibilities to you, this doesn’t mean you can abandon your responsibilities to the tenant.\nDo not turn off utilities to your rental property as a tactic to get a bad tenant to leave. Obtain an unlawful detainer or eviction order from the local court and then turning off utilities won’t be needed as the problem tenant will be gone.\n<br><br>\n**Is there anything I can do to harass or intimidate the tenant to get them to leave my rental property?**\n<br><br>\n\nThere is nothing legal that you can do to the tenant.\n\nThe eviction process can be a really annoying process for an independent landlord. It is your best bet to get your rental property cash flowing again and avoiding legal problems of your own.\ndigpads strongly recommends seeking out an eviction attorney if you have taken any of the above actions against the tenant without a court order evicting the tenant.\n",
  "published_at": {
    "$date": "2021-03-17T18:29:22.301Z"
  },
  "createdAt": {
    "$date": "2021-03-17T18:29:17.643Z"
  },
  "updatedAt": {
    "$date": "2021-03-17T18:29:22.384Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c2098e2432a001724efde"
  }
},{
  "_id": {
    "$oid": "60524cb339996f0017757498"
  },
  "metas": [],
  "Title": "How to Collect Unpaid Rent After Eviction",
  "Content": "There are several options available to a landlord for collecting past due rent after an eviction has occurred against a tenant. While the landlord tenant relationship is effectively ended and negatively via an eviction, the outstanding rent due is still legally due and you may take legal action to recover it.\n<br><br>\n**The security deposit**\n<br><br>\nSo long as your lease or rental agreement states it clearly and there are no state laws forbidding it, you may retain the security deposit to cover lost rent from tenants and damage to your real estate.\n<br><br>\n**Small claims court**\n<br><br>\nThere are a handful of courts that allow a landlord to combine eviction and small claims lawsuits so long as they are related and involve the same tenants. You can sue for any back-due rent at the same time as the eviction case if your local court allows this.\n<br><br>\nIf your local court doesn’t allow evictions and small claims lawsuits being combined, you’ll have to file a separate small claims lawsuit to pursue rent owed in arrears to recover the rent owed.\n<br><br>\nBe prepared before any court hearing with the total money owed from missed rent collection efforts. It is important to bring to court any lease agreements, documentation of when the evicted tenant did not pay the rent, and that you present this documentation to the judge to prove that the tenant failed to abide by the lease agreement in order to obtain a judgment against the evicted tenant. <br><br>\nIf a court determines that a tenant that was evicted owed you back rent, you’ll receive a legal judgement in your favor. This judgement will be delivered as a court order. \n<br><br>\n**Bank account garnishment**\n<br><br>\nWith the judgement in your favor, you may ask a court to order a bank to garnish the deposits of the evicted tenant. This ensures that if they are receiving income from alternative sources that they can't avoid paying you. \n<br><br>\nKeep in mind that there may be other creditors that have obtained the ability to garnish your former tenant's bank account and the bank will abide by who a court determines is next in line for payment from the evicted tenant.\n<br><br>\n**Garnish their wages**\n<br><br>\nYou can utilize the court judgement to force the employer to garnish the tenant’s wages and pay you before the tenant gets paid. To do this you'll need to present the judgement to the evicted tenant's employer for processing.\n<br><br>\nMuch like with the bank account garnishment, there may be others in line for money ahead of you such as child support payments.\n<br><br>\n**Garnish their tax refund**\n<br><br>\nYou can also garnish a tenant’s tax refund in some jurisdiction. Currently, this is only available in Michigan but there is talk of expanding it.\n<br><br>\n**1)Research tax garnishments.** Check with the local court that you filed your judgement in to see if your state allows tax garnishment. The majority of states require that your file within certain windows and you'll need to know these to be effective. Make sure you have the tenant’s name, social security number, and last known address readily available when you file.\n<br><br>\n**2) File the tax garnishment immediately.** You want to make sure that you are the first to file as this type of garnishment is first come, first serve.\n<br><br>\n**3) Complete the tax garnishment paperwork.** Complete the appropriate form for the jurisdiction you are in and pay the court fees which are typically fairly low. The court will make the document official for you.\n<br><br>\n**4) File the Paperwork and Notify the Tenant of the tax garnishment.** Send the completed form to the state utilizing certified mail. Be sure to send the evicted tenant a copy of the completed form using their last known address. You do not need proof that the tenant received it, only that you sent it.\nAfter taking these steps you are going to wait for tax season to get paid.\n<br><br>\n**Use a private collection agency**\n<br><br>\nThis is an expensive option for an independent landlord but in some cases it may make sense. Debt collection companies will help you collect the debt and report it to the three major credit bureaus, the same people that provide the credit reports. It’s important to let the credit bureaus know about this tenant, so future landlords will be informed. Evicted tenants who have collection agencies attempting to pursue the judgement will not be allowed to forget the rent payments they owe you.\n",
  "published_at": {
    "$date": "2021-03-17T18:38:45.376Z"
  },
  "createdAt": {
    "$date": "2021-03-17T18:38:43.732Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T19:52:23.003Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "Date": "2021-03-18",
  "category": {
    "$oid": "608c20aee2432a001724efdf"
  }
},{
  "_id": {
    "$oid": "605299ba67ca8c0017f53c2c"
  },
  "metas": [],
  "Title": "Estimated Cost of an Eviction",
  "Content": "If you're an independent landlord you'll want some insights into the total costs you'll incur to evict a tenant. It's in landlords and tenants best interests to resolve any issues without an eviction. However, tenants who won't pay rent or abide by lease or rental terms leave a landlord little choice but eviction. \n<br><br>\nThe cost of the eviction process varies depending on where you live and/or where your rental unit is. However, we can attempt to look at averages to assist an independent landlord. digpads explored the costs of evicting a tenant so you have a rough idea of costs related to file an eviction.\n <br><br>\n<u>**Attorney Fees for an Eviction**</u>\n<br><br>\nWhile you can find much more costly attorneys, the average cost for an attorney to assist in an eviction is $500.\n<br><br>\nIf you use more than a business day of their time you can expect a much higher bill. These costs can escalate quickly if a problem tenant challenges the eviction on legitimate legal grounds.\n<br><br> \n**Total Estimated Attorney Feed for an Eviction: $500**\n <br><br><br><br>\n<u>**Court Costs for an Eviction Order**</u>\n <br><br>\nThe court filing fees for the eviction tend to be flat fees and are determined by local courts. digpads estimates approximately $175 on average across the United States for eviction cases. Note that these costs can rise dramatically if the problem tenant fights the eviction and/or the eviction gets complicated.\n <br><br>\n**Total Estimated Court Costs for Eviction Order: $175**\n <br><br><br><br>\n<u>**Eviction Execution Fees**</u>\n<br><br>\nWith an eviction order from a local judge, the next step is to have a local sheriff enforce the court order. This of course assumes that the tenant does not leave on their own. These fees vary from locality but generally are around $50 which covers to enforce the eviction and do a lock out. These fees could always be higher if some complication with the tenant being evicted arises.\n <br><br>\n**Total Estimated Eviction Execution Fees: $50**\n <br><br><br><br>\n<u>**Lost Rent Payments**</u>\n<br><br>\nThe time that a landlord's rental property is not filled with a paying tenant is a a cost to a landlord.  The average rent varies greatly for the same comparable rental property from local area to local area in the United States. As of February 2020, the average rent in the United States was estimated at $1,468 per month.\n<br><br>\nThe average time from when an eviction starts to when the tenant is evicted ranges from two weeks to three months. There are outliers to this timeline. In New York City an eviction can take a year or longer due to local tenant-friendly laws.\n<br><br>\nOne also has to consider the months before the eviction was filed that led to it being filed. digpads estimates the following:\n <br><br>\n2 months nonpayment of rent + 1.5 months for eviction process + 2 months to fill the unit = 5.5 months of lost rent payments\n <br><br>\n**Total Estimated Lost Rent Payments: $8.074 (5.5 months x $1,468 a month)**\n<br><br><br><br>\n \n<u>**Property Damage Costs**</u>\n<br><br>\nThe cost of the property damage tied to an eviction can be catastrophic to a landlord. Most tenants will not completely destroy your rental property as they will face additional legal action from you as a result.\nThe cost of property damage can range from as little as a few dollars to tens of thousands or more. digpads estimates that the average landlord that goes through an eviction process will see $1,500 in property damage.\n <br><br>\n**Total Estimated Property Damage Cost: $1,500**\n <br><br><br><br>\n<u>**Listing and Marketing of the Rental Costs**</u>\n<br><br>\nAfter a landlord has evicted a tenant, the rental property will need to be rented again. This means marketing to and signing up a qualified tenant.\nMost independent landlords are going to work to keep these costs low. However, it almost always costs a landlord something to attract, screen, and sign up a tenant. Below are the estimated costs of listing and marketing a rental:\n \nPreparing for Listing Costs: $200\n<br><br>\nListing Fees for Online Listing: $150\n<br><br>\n**Total Estimate Listing and Marketing of the Rentals Cost: $350**\n <br><br><br><br>\n**TOTAL ESTIMATED  COST OF AN EVICTION: $9,149**\n<br><br>\nThis is obviously going to be lower for smaller rental unit sizes and higher for larger unit sizes. \nOf course this estimate will vary widely due to local real estate prices and particular situations. It does not take into account your time, which as an independent landlord is extremely valuable.\nAvoiding evictions is a goal of any and all landlords but is especially important to an independent landlord. One of the best ways to avoid having to evict a tenant is to do extensive tenant screening.\n",
  "published_at": {
    "$date": "2021-03-18T00:07:26.053Z"
  },
  "createdAt": {
    "$date": "2021-03-18T00:07:22.397Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T00:07:26.094Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c20c2e2432a001724efe0"
  }
},{
  "_id": {
    "$oid": "6052a10e67ca8c0017f53c2d"
  },
  "metas": [],
  "Title": "How to Select an Eviction Attorney",
  "Content": "# How to Select an Eviction Attorney\n\n\nAn unfortunate but necessary situation in the landlord and tenant relationship is the need to evict a tenant for unlawful detainer. In most circumstances, if an independent landlord follows the law, they won't need an eviction lawyer to evict an attorney from your rental property.\n<br><br>\nThere are some situations and some states where identifying, vetting, and retaining an eviction attorney for landlords is a good idea. Unless you know before starting an eviction proceeding that the eviction case you are pursuing is going to be messy, it often makes sense to wait on obtaining legal services. Most eviction process legal actions such as providing an eviction notice can be done without the use of an attorney.\n<br><br>\n## **Considerations when Hiring an Eviction Lawyer**\n<br><br>\n**1) Attorney's Knowledge about local real estate and landlord tenant law.** Attorney's focus on different aspects of the law, for example some focus on residential and commercial evictions and some only focus on one.\n<br><br>\nFor a residential eviction case, you want an attorney with ample knowledge in this legal space. It is especially important that the attorney you hire to prosecute the eviction is aware of local laws, be they state, country, or city directed. You may want to ask the attorney about the number of eviction cases they have handled and what their case win rate is.\n<br><br>\n**2) Experience litigating residential eviction cases.** Knowledge is one thing, experience is another. Any legal issue has the potential to become more complicated than it appears on the surface. If this happens, an experienced attorney will know how to navigate the legal system to deliver the best possible result for you.\n<br><br>\n**3) A Law firm or lawyer's professional reputation is important.** Like any other profession, there are unscrupulous attorneys whose only mission is separating you from your hard earned cash. You might ask for references and/or search for reviews on the law firm or attorney online to assess their reputation. Be aware that reviews online are often gamed by the subject of the review.\n<br><br>\n**4) The lawyer's fees to represent you in an eviction.** Most attorneys are going to want a retainer and then will charge by the hours thereafter. Attorney's may charge whatever they'd like so you may find a wide range of legal fees between providers. That being said, attorneys need to be competitive in the market like any other profession.\n<br><br>\nA landlord can expect to pay around $500 for an attorney to handle a routine eviction.  Some attorneys may charge a lot more. Very successful attorneys with great knowledge and experience may charge more than this. Like any purchasing decision, weigh all factors when making a determination on value.\n <br><br>\nSome landlords utilize the problem tenant's security deposit to pay a portion or all of their attorney fees for evictions. digpads recommends you only do this if you and your attorney feel very strongly that you will win the case.\n<br><br>\nMost attorney's will offer free consultations at their law office to prospective clients. They will provide free legal advice that can be provided prior to retaining the attorney. \n<br><br>\nWhether you decide to hire any attorney or not, in many states an eviction can be served, court hearing commenced. and the tenant successfully evicted in 30 days or less. After that, you're back on the road to having a tenant in your rental unit that pays rent and follows your landlord rules.\n",
  "published_at": {
    "$date": "2021-03-18T00:38:40.906Z"
  },
  "createdAt": {
    "$date": "2021-03-18T00:38:38.470Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T19:51:26.988Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "Date": "2021-03-18",
  "category": {
    "$oid": "608c20d6e2432a001724efe1"
  }
},{
  "_id": {
    "$oid": "6052a3ed67ca8c0017f53c2e"
  },
  "metas": [],
  "Title": "Do I Need an Attorney to Evict a Tenant?",
  "Content": "# Do I Need an Attorney to Evict a Tenant?\n<br><br>\nIndependent Landlords have a difficult decision to make when considering whether or not to hire an attorney for an eviction case.  When the landlord tenant relationship breaks down and a tenant is either not paying rent or is violating some portion of your lease or rental agreement, a landlord's only choice is to begin the eviction process to remove the tenant from your rental unit.\n<br><br>\nEven without hiring a lawyer you are going to incur court costs, missed rent income, and damage repair. While in most vanilla eviction cases you can likely successfully evict the tenant without obtaining a lawyer, there are some situations where hiring an attorney to process a formal eviction is the better option. So before providing the problem tenant with that eviction notice, read below to consider your risks of not hiring an eviction attorney.\n<br><br> \n**Reasons to Consider an Eviction Attorney**\n<br><br>\n**1) You have a lot of assets (likely real estate) and income and therefore could be a target to an unscrupulous tenant or pro-tenant eviction lawyer.** it is highly advisable to hire an attorney for any eviction proceeding if an unscrupulous tenant starts working with a pro-tenant eviction lawyer. This is even more important when you have a lot of assets or income to protect. These are the types of people they target for a settlement.\n<br><br>\nThese types tend to try and entrap a landlord to make a mistake so they can sue them for damages. It's better to be safe than sorry when involved in legal actions with these types.\n<br><br>\n**2) A nonprofit pro-tenant group gets involved in the eviction proceedings.** There are several national and local nonprofit pro-tenant groups that provide free legal resources and in some cases free eviction legal advice to tenants.\nWhen these groups aid a tenant, you can expect them to be looking for any loophole in the law to prevent the problem tenant from being legally evicted. \n<br><br>\nOne of the most common legal angles these groups employ is to critique the amount of time the landlord gave the problem tenant to vacate the rental property. When these groups get involved in your eviction case, it may mean it's time to lawyer up to protect yourself.\n<br><br>\n**3) You have complicated the eviction by breaking a law or regulation.** If you've broken a state law or any law that gives the tenant a defense against you (such as harassment), you should likely strongly consider hiring an attorney. Simple eviction cases can quickly become very complicated if a tenant broke a law or took actions into their own hands outside of the eviction process. Its in a landlord's best interest to hire an attorney if this is the case.\n<br><br>\n**4) The tenant has threatened credible legal action against you.** This one speaks for itself. If the tenant is threatening legal action and is credible, hiring an attorney will help you defend yourself against their allegations. Many people threaten legal action who have no intent of taking it so first ensure that the tenant is credible in this threat before determining your best course of action.\n<br><br>\n**5) Your rental property is in a tenant favoring state or jurisdiction.**  Most eviction laws are state laws or local laws. Certain states tend to favor tenants over landlords in evictions.\n<br><br>\nNew York and California are two states that stand as prime examples. New York City and San Francisco are cities that are notorious for making it hard for landlords to evict tenants, even if the landlord is legally 100% in the right.\n<br><br>\n**6) The eviction is in a state or city you do not live in or near.**  If you own rental units that are not near where you live, there will often be travel costs involved in pursuing an eviction. Local attorneys tend to know the local court and local laws very well and can therefore assist you in navigating them towards a successful eviction.\n\n\n",
  "published_at": {
    "$date": "2021-03-18T00:50:56.559Z"
  },
  "createdAt": {
    "$date": "2021-03-18T00:50:53.801Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T00:50:56.581Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c202fe2432a001724efda"
  }
},{
  "_id": {
    "$oid": "6052a66e67ca8c0017f53c2f"
  },
  "metas": [],
  "Title": "Alternatives to Eviction for Landlords",
  "Content": "# Alternatives to Eviction for Landlords\n<br><br>\nNeither landlords or tenants want an eviction. It's expensive, a loss of income, and a hassle for landlords and it's a lifelong problem for tenants as it goes on their record. Managing real estate means at some point you will likely face the decision to evict a tenant. If you want to avoid court costs, the possibility of losing an eviction, and the possibility of an angry problem tenant damaging your property, you may want to consider alternatives to eviction.\n<br><br>\n**Negotiate a Payment Plan with the Tenant**\n<br><br>\nGood tenants pay rent in full and on time, don't violate terms of the lease and treat your rental property as if it were their own. It's important to understand that even good tenants come across bad times and occasionally make mistakes.\n<br><br>\nIf a good tenant has a temporary problem like job loss or has violated a lease term but is sorry for the problem, you may want to consider working with that tenant. A payment plan can include letting the tenant pay back due rent over a longer period, changing when payment is due, or temporarily reducing rent. \n<br><br>\nHave an honest discussion with the good tenant and see what may make sense for you and the tenant.\ndigpads does not recommend that you attempt this method with a bad tenant. digpads recommends that a landlord refuses to negotiate a payment plan with any tenant that:\n<li>Does not communicate with you about unpaid rent and/or ignore your inquiries about it\n<li>Continues to violate a lease term after you pointed it out and is not sorry for the problem; or\n<li>Those who are hostile towards you in defending your landlord rights.\n<br><br>\nThe obvious downside to a negotiated payment plan with a problem tenant is that you will have to wait longer to receive your rental income from the tenant.\n<br><br>\n\n**Mediation to Resolve Conflict with the Tenant**\n<br><br>\nAnother alternative to evicting a tenant is to hire a mediator to hear the landlord and the tenant's  respective sides in a dispute. Mediators are trained to gather all available information from all parties evolved in a dispute and understand each party's point-of-view in a conflict.\n<br><br>\nThe goal here is to find an acceptable option to avoid an eviction. If the mediator can't find that alternative, they may advise the landlord how to proceed. \n<br><br>\nIt is important to note that a mediator's decision is not legally binding unless the two parties agree that it will be before mediation begins. The hope of mediation is that the mediator can help the parties find common ground and avoid an eviction. \n<br><br>\nOne of the downsides to the mediator is that they can be expensive and if a landlord is considering evicting a tenant they are likely already being hurt economically by the situation.\n<br><br>\n**Offer the Tenant Cash for Keys**\n<br><br>\nThe Cash for Keys method is essentially a way to reward the problem tenant for leaving on their own accord without an order from a court by a certain date. Offering cash for keys is oftentimes a hard decision for a landlord as they feel mistreated by a tenant and they have to overcome this feeling.\n<br><br>\nIf offering a problem tenant a reward for abandoning their lease is less costly and time consuming than the eviction process, it may be a good alternative for a landlord. Court fees and attorneys fees can be very expensive and the longer an eviction goes on, the less rental income a landlord is receiving.\n<br><br>\nThe cash amount offered by a landlord is commonly enough to cover moving expenses and a deposit on a new rental property. Tenants and landlords may come to whatever arrangement makes sense for them both.\n<br><br>\nMany landlords will feel that this rewards a bad tenant's behavior and will not be able to stomach this approach.\n<br><br>\n**Don't Renew the Tenant's Lease Agreement**\n<br><br>\nA landlord can refuse to renew a bad tenant's lease agreement before it renews. Most leases require a  30 or 60 day notice if a landlord intends to not renew the lease, but each lease agreement is different. While this doesn't immediately solve the landlord's problem, it does attempt to avoid an eviction. \n<br><br>\nCommunication with the tenant on how it's in their best interest to move at the end of a lease to avoid a harmful eviction on their record may aid a landlord.\nThis doesn't solve the bad tenant problem quickly. A landlord must balance the situation and the timeline for eviction to determine if this is a good option for them or not.\n<br><br>\n**Hire a Property Manager to Manage Your Rental Properties**\n<br><br>\nWhile it is definitely a more expensive option, hiring a property manager to manage your rental properties may avoid future evictions. Property managers deal with tenants daily and frequently and oftentimes have strategies for attracting, retaining and addressing issues before they turn into an eviction.\n<br><br>\nProperty Managers are not free and take a percentage of rent as payment for services each month. An independent landlord has to determine for themselves if this cost is worth offloading the burden of managing the rental property.\n",
  "published_at": {
    "$date": "2021-03-18T01:01:36.249Z"
  },
  "createdAt": {
    "$date": "2021-03-18T01:01:34.442Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T01:01:36.272Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c204ce2432a001724efdb"
  }
},{
  "_id": {
    "$oid": "6052a7db67ca8c0017f53c30"
  },
  "metas": [],
  "Title": "Why I Leased to a Tenant with a Bankruptcy and Poor Credit",
  "Content": "# Why I Leased to a Tenant with a Bankruptcy and Poor Credit\n<br><br>\nIt was Summer of 2019 and I was in the process of moving back to St. Louis, MO from Tulsa, OK. I had purchased two rental properties in North Springfield, MO that was on the driving route between these two cities. Why did I buy in Springfield, MO? Simple, high cap rate possibilities with the purchase price to rent, low regulations and a city that I believe would grow in the future. \n\nThe Tenant of one of these properties gave notice on a month-to-month lease that they were moving out and thus terminating the lease. Why did I have a month-to-month lease? When I acquired the property this is what the former landlord had in place and it was easier to keep the existing deal than risk losing what looked like good tenants. The timing could not possibly be worse, but that is life.\n\nI first finished my move, accepting the fact that I would not be collecting rent for a few months, and then went about the process of finding a new tenant.\n\nI dealt with the tenant moving out,  recruited a contractor friend of mine to help repair the flooring which was messed up along with a few other improvements and listed the unit on Craigslist in Springfield. As an independent landlord who manages my own units - two of which are not in St. Louis, MO where I live and work, I have to think of creative ways to reduce costs. \n\nThe scheme I came up with was to place a lock box on the door and request that any prospective tenant that wants to view the unit provide me a copy of their driver’s license, phone number and current address in order to view the unit. I got a decent amount of interest but I filtered the tenants out from the beginning based on their interactions with me. What do I mean by that? Rude, unresponsive, aggressive or demanding tenants did not get a reply. Why would I want to rent to someone who can’t act decent? \n\nA few tenants that were otherwise fine in their behavior did question providing this information. When I explained the situation, they understood, provided the information and were given the access code to get the key. I gave explicit instructions to replace the key and lock the door, sending me a photo of it when it was done. I did high level Google Searches of the people responding as well and if I saw even a hint of a problem they either were not responded to or I cut off communications. One person has a criminal record that was extensive and easily findable online. Another had a series of judgements against them legally. If you know how to DIY background check on the internet, there is a lot you can find!\n\nI should mention that I had the other tenant living next to this unit watch the place as well as a favor and since they were great tenants who work from home, they were happy to help.\n\nAfter two inquiries that all led to visits to the rental property by tenants that were not sold and not moving forward, a gentleman in his mid-50s contacted me. From the beginning he admitted that he was recently divorced, his wife had been reckless and spent their money, had two dogs that ruined a rental unit and that he had recently had to declare bankruptcy. Obviously, this is not the ideal tenant for most landlords. I approached the situation cautiously. I felt for the man but I was not about to lease to him on my emotions alone - this is always a bad idea. He did have a current employer and had recent paycheck stubs to confirm his employment. His application indicated that he had enough cash in a month with his job to cover the monthly rent.\n\nI asked him to explain the situation in more detail and asked him if prior to these more recent events with his wife if he had ever had an eviction, criminal history or negative credit issue that was material. He said no. I informed him that I needed to run a background and credit check and that he would need to pay for this. I asked him if I would find anything on these tenant screening checks that he would have to pay for as a part of the application. He said no. He was living with his daughter, getting into it with her husband and wanted his own place. \n\nI told him that if his story checked out and this was a one-time event, I would lease the rental property to him.    \n\nSo, what was I thinking? I was thinking the following:\n\n- Nearly everyone in life has setbacks and many times they are tied to love. While I approached the situation in a sober way, I also did not want to automatically discount this man who approached me being upfront from the beginning. I wanted to give him a chance but also to confirm or disprove his story.\n\n- My theory was that if his story checked out, here is a prospective tenant with a credit issue that likely is not going anywhere. He could be a tenant for years and so long as he pays and on time, what do I care that he had a setback in life? I saw this as a potential win-win for both of us\n\nTo confirm his story I ran a tenant screening report that he paid for. I contacted his employer to confirm his employment which checked out.\n\nThe credit report and background report came back and it confirmed his story. I had a few clarifying questions but here was a mid-50s man who had rented his entire life and never had an issue until this recent situation with his wife. I drove to Springfield to meet him in person with the lease in hand. He handed over the security deposit and the first months rent. He moved in that day.\n\nSo, what has been the outcome? \n\nOverwhelmingly positive. He pays his rent on time. On a few occasions when there were going to be delays he lets me know and pays the late fee. It has never been more than a week late. He keeps the yard and the property in better shape than the previous tenant and he keeps to himself and causes no problems. He continued to pay rent during the Covid 19 shutdown and eviction moratorium even though he could have played games and not done so.\n\nWhat is my point?\n\nIn some circumstances it may make sense as an independent landlord to select the tenant that is not perfect. Decent, honest and reputable people have setbacks in life. Sometimes it is good to look at the total picture before dismissing people entirely based on a report.\n\nI have known people on paper that look like Saints but in reality are absolute monsters. Make your own decisions and take on a risk that is acceptable to you but take this story as an example that not all tenants with some unfortunate things in their past are by default bad tenants. ",
  "published_at": {
    "$date": "2021-03-18T01:08:15.088Z"
  },
  "createdAt": {
    "$date": "2021-03-18T01:07:39.044Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T01:08:15.103Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c207be2432a001724efdc"
  }
},{
  "_id": {
    "$oid": "6052b149d141320017b6a3c4"
  },
  "metas": [],
  "Title": "Caulk is a Landlord’s Best Friend",
  "Content": "# Caulk is a Landlord’s Best Friend\n<br><br>\nTenants typically rent a rental property due to its location, its price, and how nice it looks. The reason looks are emphasized is that a rental property may have issues under the finish of its features, but what really matters is how it looks. This is where caulk becomes a very valuable tool for landlords. \n<br><br>\nAs a rental property ages and tenants rough it up a bit, landlords will find themselves with problems in finished items such as existing caulk itself, flooring, trim, siding and more. Repairing and replacing finished items in a rental property can be expensive and keeping costs low is part of the business model of being a landlord. If most of a finished item is intact with minor imperfections, consider using caulk to solve the problem.\n<br><br>\n**What is caulk?**\n<br><br>\nCaulk is a sealant that is used for covering seams, holes, and gaps in finished items. Caulk is most commonly used in bathrooms and kitchens to cover the areas where cabinets, basins, and tubs meet walls and floors. Caulk is commonly utilized to repel water and seal areas as well to prevent water damage. Caulk can be used inside and outside. Caulk comes in many different types depending on the application needed.\n<br><br>\n**How is caulk used?**\n\nCaulk is utilized via a caulk gun that the tube of caulk is placed in after the user cuts a hole on the top of the caulk tube (pointy end) and after the skinny metal rod on the caulk gun is inserted in the cut hole to break the caulk tube seal. The caulk gun is then squeezed via the trigger which released the caulk. \n\nIt is a good idea to keep a wet rag and/or a bucket around when using caulk as it can get messy. A user dispenses a small bead of caulk on the area that is desired to be covered and then spreads the caulk evenly to cover the seam, hole, or gap. Most caulk users utilize their fingers to spread the caulk and then wipe off the excess with a rag.\n\n**How can a landlord use caulk to make things look nicer and avoid costly repairs?**\n\nCaulk can be utilized to hide imperfections and gaps. When used correctly, caulk can make it more difficult to notice imperfections. Some examples include:\n\n**Old Caulk** - If old caulk has eroded or separated then new caulk may be applied to correct the problem. The proper way to reapply caulk is to first cut out the old caulk. That being said, a user may apply caulk over the old caulk but it may not look as clean as applying new caulk after cutting the old caulk out or work as well.\n\n**Flooring** -  If flooring such as tile has gaps between it or has exposed sections along the wall, landlords may be able to utilize caulk to cover these gaps. A great example of this is at one of the digpads founder’s rental properties old commercial tiles were intact but had gaps between them due to tenant abuse and uneven floors. Filling these commercial tiles, that were white, in with white caulk covered these gaps and made the floor look materially better. Another example is that if a floor is laid and there is a gap between the flooring and the wall that is not covered by the trim or baseboards (such as is the result of making bad cuts in tile) then a landlord may utilize caulk to cover this gap. \n\n\n**Trim, Baseboards, and Quarter Round** - Trim, baseboards and quarter round use caulk to eliminate gaps in any of these as they connect with the floor and walls. In addition, trim, baseboards, and quarter round are attached to the floor and walls via nails and it is commonly desirable to cover these nail holes before painting. While there are other options, such as putty, caulk is commonly used to fill in nail holes in trim, baseboards, and quarter round.\n\n**Siding** - Caulk comes in different colors so a user is not limited to only white. This is great as it allows a landlord to utilize caulk in a color that matches siding for siding patches if extra siding is not available. Siding can be patched with caulk in a way similar to mudding two drywall joints where it is taped before the siding is applied. \n\nThis is really only a sampling of all the ways caulk can be utilized by landlords to cheaply make damaged finished items look better. \n\nPlease note that landlords do not want to use caulk for very large openings as it will not stay together and will not hide the large openings as a result. Options for larger openings include backerboard and Big Gap Filler to fill the large holes or gaps and then applying caulk after these items have filled the larger cavities. \n",
  "published_at": {
    "$date": "2021-03-18T01:48:00.402Z"
  },
  "createdAt": {
    "$date": "2021-03-18T01:47:53.837Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T01:48:00.461Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c208ae2432a001724efdd"
  }
},{
  "_id": {
    "$oid": "60536d70b664d00017fa2bb8"
  },
  "metas": [],
  "Title": "Missouri Eviction Laws for Landlords",
  "Content": "# **Missouri Eviction Laws for Landlords**\n\nIf you are a landlord that owns rental property in the state of Missouri you'll want to ensure that you understand the eviction laws in the state. Failure to abide by state laws on eviction can result in a lot of legal problems for a landlord as well as a problem tenant that remains in their rental property.\n<br><br>\nThere are two procedures for eviction problem tenants in Missouri. The first is rent and possession for nonpayment and the other is unlawful detainer. Unlawful detainer is primarily used for tenants that stay past their lease expiration and violations of the lease terms that are egregious enough to justify an eviction.\n  <br><br>\n**Legally Valid Reasons to Evict a Tenant in Missouri**\n <br><br>\nThe legally valid reasons a landlord may evict a tenant in Missouri include:\n<br><br>\n<li>Staying in a rental property after the expiration of a lease agreement's terms.\n<li>A tenant that is not paying rent as a lease agreement requires.\n<li>Damage to the rental property in excess of normal \"wear and tear\" damage.\n<li>A violation of any lease terms.\n<li>Any occurrence of illegal gambling on the rental property.\n<li>Any illegal drug-related activity on the rental property.\n<li>Assault of another tenant or on the landlord by the problem tenant.\n <br><br>\n\n**There is No Self-Eviction in Missouri**\n <br><br>\nA landlord may NOT evict a tenant in the State of Missouri without an order from a court authorizing it. Self-eviction includes any action designed to force the tenant to vacate the premises.\n <br><br>\nIf the landlord takes the law into their own hands they may be liable for up to two times the damages incurred by a tenant.\n  <br><br>\n \n**Missouri Eviction Notice Requirements**\n <br><br>\nThe Missouri eviction process does not include a particular amount of time for a notice requirement in cases of nonpayment of rent. The eviction notice does need to demand that the rent be paid.\n\nIn Missouri, lease violations require 10 days notice to vacate but do not need to offer the tenant the ability to correct the issue, that is at the landlord’s discretion. \n\nFor tenants staying in a rental unit past the lease termination date, the landlord is required to serve a 30 day notice to vacate.\n\nA Missouri Eviction Notice must be served in person, called personal service, to the tenant or by delivering it to a person at least 15-years of age who lives at the rental property. If no one is present during the delivery of the notice, the server may post the demand but they must complete a sworn affidavit stating that the problem tenant was served. The landlord or a representative may deliver the notice to the tenant.\n\nA Missouri eviction notice does not need to be served if there is unlawful drug-related or any violent criminal activity. The landlord does not have to wait for a conviction in these cases and may immediately apply to the court to begin the eviction action.\n  <br><br>\n**Court Actions Required in an Missouri Eviction**\n<br><br>\nIn nonpayment of rent eviction cases and after a written demand to vacate has been made, the landlord must submit an affidavit to the circuit court in the jurisdiction where the property is located. This affidavit needs to include a description of the property, the lease terms, the total outstanding rent owed to the landlord, and confirm that the problem tenant was given notice to correct the issue and that they did not do so.\n \nThe court clerk will determine a court date and issue a summons to the problem tenant. The problem tenant will need to show why possession of the property should not be returned to the landlord.\n \nA tenant can stop the eviction and have the eviction action dismissed if he or she tenders the entire amount due along with court costs before the court date.\n  <br><br>\n**Missouri Eviction Unlawful Detainer Actions**\n <br><br>\nWhen the notice period for the eviction type has expired and if the tenant has not complied with the notice's requests, the landlord must file a lawsuit that is called an “Unlawful Detainer Action.”\n  <br><br>\nThe landlord then submits the Landlord’s Complaint to the proper circuit court with a description of the property, the type of lease violation, and the name of the tenant that violated the lease terms. If everything is in order the court clerk issues a summons for the tenant to appear in court.\n  <br><br>\n**Service of Summons and Tenant Counterclaims**\n <br><br>\nA summons is then delivered to the tenant by a sheriff or court official. A court date is scheduled for no more than 21 days. The landlord may request a date later than 21 days.\n <br><br>\nThe summons may be served personally on any person that is at least 15-years of age that resides on the property. It may also be served by posting and mail. A landlord may only obtain possession of the property and may not collect any monetary damages if the tenant is not served personally or a person not of suitable age is served. The landlord must file a motion and obtain a court order to serve a tenant via posting.\n <br><br>\nAny counterclaims from a tenant must be submitted in writing prior to the court date.\n  <br><br>\n**Court Date for Tenant Eviction in Missouri**\n <br><br>\nThe court will issue a judgment for possession to the landlord if their case is proven to the court or the problem tenant does not appear in court.\nA tenant in an unlawful detainer case may be ordered by a judge to pay two times the amount of rent for the time he or she remained after the notice to vacate the property date.\n <br><br>\n**Judgment and Writ of Execution in Missouri**\n <br><br>\nThe problem tenant has 10 days to file an appeal to an eviction order. After this 10 day period, the court will issue the landlord a Writ of Execution if requested.\nThe sheriff schedules an eviction date upon receipt of the Writ of Execution. The Writ of Execution does expire and the landlord must contact the sheriff’s office 7 days or more before the expiration date.\n \n \n",
  "published_at": {
    "$date": "2021-03-18T15:10:43.434Z"
  },
  "createdAt": {
    "$date": "2021-03-18T15:10:40.208Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T15:10:43.452Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c2098e2432a001724efde"
  }
},{
  "_id": {
    "$oid": "60536fbeb664d00017fa2bb9"
  },
  "metas": [],
  "Title": "Illinois Eviction Laws for Landlords",
  "Content": "# Illinois Eviction Laws for Landlords\n<br><br>\nLandlord-tenant relationships commonly break down around nonpayment of rent or lease violations.\nIf you are a landlord that owns or manages rental property in the state of Illinois you'll want to ensure that you understand the eviction laws in the state. Failure to abide by state laws on eviction can result in a lot of legal problems for a landlord and you may not successfully evict the problem tenant either.\n <br><br>\n**Legally Valid Reasons to Evict a Tenant in Illinois**\n <br><br>\n<li>The tenant fails to pay the rent under the terms as outlined in the lease agreement.\n<br><br>\n<li>The tenant violates any of the terms or rules in the lease agreement.\n<br><br>\n<li>The tenant damages the property in a material way.\n<br><br>\n<li>The tenant does not leave the property after the lease expired. This is called a holdover tenant.\n<br><br>\n<li>The landlord gives a notice to move and the tenant does not have a written lease and pays rent monthly.  \n<br><br>\n\n**There is No Self-Eviction in Illinois**\n<br><br>\nA landlord may NOT evict a tenant in the State of Illinois without an order from a court authorizing an eviction. Self-eviction includes any action taken by the landlord outside of the normal legal process designed to force the tenant to vacate the premises.\n <br><br>\n**Illinois Eviction Notice Requirements**\n<br><br>\nAll residential evictions in the State of Illinois eviction process begins with service of a written notice to the tenant. The reason for the eviction and the type and duration terms of the lease agreement dictate the Illinois eviction notice period that applies to each situation.\n<br><br>\nService of an eviction notice in Illinois is legally valid by personal service on the tenant, on a tenant who is at least 13 years old, or by certified or registered physical mail. A server may not post the notice on the door or by leaving it in a public place. The one exception to the posting law is if the tenant has abandoned the property and it is vacant a landlord may post the notice of eviction.\n<br><br>\nAn eviction notice in Illinois must clearly describe the leased property, the tenant action or inaction that led to the eviction, and state that the lease will terminate on a specific date after the service of the eviction notice. The notice period starts on the business day (weekdays only) the tenant receives the notice. A landlord may select any day notice for compliance he or she would like, but it must be more than the statutory notice period demanded by Illinois State law.\n<br><br>\n**Eviction Days Notice by Type**\n<br><br>\nFor a Nonpayment of Rent Eviction,  a 5-day notice is required when serving a tenant. If the tenant pays the entire rent within the 5 days, or if he or she pays the rent beyond the 5 days but before the landlord files a Summons and Complaint for Forcible Entry and Detainer, the eviction process cannot be continued.\n<br><br>\nIn all situations other than nonpayment of rent, a 10 day eviction notice must be served. These situations include noncompliance with the rental agreement or damaging the premises. The tenant only has 10 days to cure the noncompliance or vacate the premises. A general description of the conduct that is in noncompliance is required in the notice.\n<br><br>\nIn a situation where there is an Oral Lease, No Lease (or Rental) Agreement, or Less than 30 day lease, a 30-day notice period to quit the premises is required.\n<br><br>\nIf the lease is a Month-to-Month Lease, the landlord must provide the tenant 30-days written notice but no reason must be given to the tenant for the eviction.\n<br><br>\nIn situations where a tenant is a Holdover, or staying beyond the expiration of the lease when there is no automatic extension or agreement to extend it, the landlord may immediately file a Forcible Entry and Detainer action in court and does not need to serve notice to the tenant.\n <br><br>\n**Court Actions Required in an Illinois Eviction**\n<br><br>\nA landlord must then file a copy of the notice that was served and a notarized certificate of service  with the court. This is a legal requirement of a landlord in Illinois.\n<br><br> \n**Illinois Eviction Forcible Entry and Detainer Action**\n<br><br>\nIf the notice period has expired and the tenant has not corrected the eviction cause, the landlord must file a Forcible Entry and Detainer action in a court against the tenant in a court jurisdiction where the property is located. Once the court has received a copy of the notice and a notarized certificate of service, the complaint can be completed at the court clerk’s office and filed with the local court.\n<br><br>\nIf the landlord prefers a jury trial, he or she must demand it when the complaint is filed with the court. The majority of eviction cases are heard before a judge.\n<br><br> \n**Service of Summons and Tenant Counterclaims**\n<br><br>\nA sheriff or a process server serves the tenant with the court notice of an eviction case. The court summons will have the time, date and location of the hearing on it . If the tenant wants a jury trial, he or she can request it in their reply to the court. The tenant will need to pay jury fees before or the day of court if they choose a jury trial.\n<br><br>\nThe landlord must prove that the proper notice of eviction was served to the tenant, that the tenant violated the lease, and that the complaint was legally filed in court and served to the tenant as directed by law. \n <br><br>\n**Court Date for Tenant Eviction in Illinois**\n<br><br>\nIf the tenant does not appear for the court hearing on the assigned date and time, a default judgment will be entered in favor of the landlord. If the tenant appears in court and is challenging the eviction, the judge may either hold the hearing that day or reschedule it for a future date.\n<br><br>\nA landlord needs to bring all physical evidence and any witnesses to corroborate evidence to court on the day of the trial.\n <br><br>\n**Judgment and Writ of Execution in Illinois**\n<br><br>\nIf the landlord wins the eviction case, the judge will issue a judgment ordering the tenant to vacate and, if applicable, stating the amount of outstanding rent owed to the landlord. The court may allow the tenant several days to vacate and to find a new residence.\n<br><br>\nIn nonpayment of rent cases, the judge may impose an order establishing a payment plan for the tenant being evicted. Please note that in Illinois there are certain applicable exemptions for low income tenants paying overdue rent.\nIf the tenant does not leave the rental property on their own, the sheriff may forcibly evict the tenant. The sheriff must receive a copy of the judgment before enforcing the eviction.\n<br><br>\nPlease be aware that the eviction process in Cook County, the largest country in Illinois that contains Chicago and some of the suburbs, has a different eviction procedure than the rest of the state of Illinois. digpads strongly recommends that landlords who own or manage rental units in Cook County research the specific eviction laws there before taking any actions against tenants. \n<br><br>\nWhile digpads' recommendations do not constitute legal advice, Cook County is not considered a landlord-friendly area by digpads and landlords should proceed with caution.\n \n \n \n",
  "published_at": {
    "$date": "2021-03-18T15:34:53.670Z"
  },
  "createdAt": {
    "$date": "2021-03-18T15:20:30.378Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T15:34:53.699Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c20aee2432a001724efdf"
  }
},{
  "_id": {
    "$oid": "605374d0b664d00017fa2bba"
  },
  "metas": [],
  "Title": "Kansas Eviction Laws for Landlords",
  "Content": "# Kansas Eviction Laws for Landlords\n<br><br>\nIf you are a landlord that owns rental property in the State of Kansas you'll want to ensure that you understand the eviction laws in the state. Failure to abide by state laws on eviction can result in a lot of legal problems for a landlord as well as a problem tenant that remains in their rental property.\n<br><br>\nThe Kansas eviction process has a few unique requirements compared to other states. The primary outliers for eviction proceedings in Kansas are the type of notice required and the time limits for tenants to vacate for each specific situation.\n<br><br>\nIf a landlord fails to adhere to the Kansas eviction process, their eviction case could be dismissed or if the landlord attempts any self-eviction measure(s), a tenant can sue the landlord for damages in court.\n <br><br>\n\n**Legally Valid Reasons to Evict a Tenant in Kansas**\n<br><br>\nThe legally valid reasons a landlord may evict a tenant in Kansas under Kansas law include:\n<br><br>\n<li>If the tenant fails to pay rent in the amount and in the time period stipulated in the lease agreement.\n<li>If the tenant violates a lease term within the lease agreement. The court will generally want it to be a material lease term and not something relatively minor.\n<li>If the tenant violated any laws at the rental property.\n<li>If the tenant is a holdover, or a tenant that stays behind after the expiration of their lease agreement.\n<li>If the tenant knowingly allowed criminal activity to occur on or near the rental property.\n<br><br>\nAll of the above reasons are considered legitimate situations in which to bring an eviction action against a tenant.\n <br><br>\n\n**There is No Self-Eviction in Kansas**\n<br><br>\nA landlord may NOT evict a tenant in the State of Kansas without an order authorizing an eviction which requires a court hearing. Self-eviction includes any action taken by the landlord outside of the normal legal process designed to force the tenant to vacate the premises.\n<br><br>\n**Kansas Eviction Notice Requirements**\n<br><br>\nAny Kansas eviction notice must be properly served to the tenant or the eviction lawsuit may be dismissed by the local court. A landlord may serve the tenant themselves or a resident of the rental property who is at least 12 years old.\n<br><br>\nIf it is not possible to serve anyone in person at the rental property, the landlord may post the notice on the rental property's door or by placing it in some other obvious place. The notice may also be sent by registered or certified mail. There must be clear evidence of notice having been served to a tenant. Some courts in Kansas require a photo of a notice attached to a door if the tenant avoids or refuses service.\n<br><br>\nAny notice that is mailed receives an additional 2 days for the tenant to comply. The notice period only includes weekdays and does not include holidays or weekends.\n<br><br>\nFor nonpayment of rent, the Kansas eviction process requires that a 3-day notice be used. The notice must clearly state the amount of rent owed to the landlord. The notice should inform the problem tenant that the lease will terminate unless the tenant pays the required rent within 3 days. The notice should also inform the tenant that legal action will be pursued if the tenant remains on the premises after not paying the rent within the allotted time period.\n<br><br>\nFor material noncompliance with the rental agreement (other than nonpayment of rent), the landlord must serve the tenant with a 14/30 day notice. The tenant is allowed 14 days to comply with the particular lease term that is being violated. The notice must state that the lease will terminate 14 days after service of the notice unless the situation is corrected by the tenant. \n<br><br>\nThe notice must also include that if there is noncompliance with the notice, then the tenant must vacate within the next 30-days or legal action will be taken against the tenant.\n<br><br>\nWhen a month-to-month lease is in place, a landlord can terminate the lease without providing a reason and by giving the tenant a 30 day notice, giving the problem tenant 30 days after the 30-day notice is served to vacate the rental property.\n<br><br> \n\n**Court Actions Required in an Kansas Eviction**\n<br><br>\nShould the tenant fail to pay the rent or cure the lease violation and vacate after 30-days, the landlord must file and serve a summons and petition for forcible detainer. The landlord may include in the petition a request for monetary damages including the payment of rent owed.\n <br><br>\n\n**Kansas Eviction Docket Call Actions**\n<br><br>\nThe court clerk will set a hearing date for a “docket call.” The \"docket call\" hearing is not less than 3 or more than 14 days after the filing.\n<br><br>\nThe docket call acts as a preliminary hearing to an eviction hearing in which the court attempts to assist the the parties to resolve their outstanding issue. If the court is not able to facilitate a resolution between the landlord and the tenant, the court schedules a trial within the next 8 days.\n<br><br>\nThe tenant must appear in person to the hearing and contest the petition or be determined to be in default. If the tenant is found in default, the landlord will be able to move forward with the eviction unopposed.\n <br><br>\n\n**Service of Summons in Kansas**\n<br><br>\nThe tenant is served with the summons and petition by the local sheriff. This summons and petition advises the tenant of the time, location, and any other logistical details of the court hearing. \n <br><br>\n\n**Court Date for Tenant Eviction in Kansas**\n<br><br>\nAn eviction hearing is conducted before a judge approximately 8 days after the docket hearing has commenced. The landlord and tenant may present their respective cases but the landlord must prove to the court that the tenant either failed to pay rent to the landlord when rent is due or failed to cure the violation of the lease terms by the time allowed.\n<br><br>\nIf the landlord wins in court, the court will issue a judgment of possession for the landlord. The tenant will be asked to vacate the rental unit within a set period of time. \n <br><br>\n\n**Judgment and Writ of Restitution in Kansas**\n<br><br>\nIf the tenant remains at the rental unit after the time period given to vacate, the landlord must obtain a Writ of Restitution from the court. Once the Write of Restitution is given to the sheriff, the sheriff will execute the Writ within 10 days.\n<br><br>\nThe Write of Restitution empowers the sheriff to remove the tenant and the tenant’s property from the landlord's rental property. A few counties in Kansas require the landlord to supply their own workers to remove the tenant’s possession while being supervised by the local sheriff.\n\n\n\n",
  "published_at": {
    "$date": "2021-03-18T15:42:11.432Z"
  },
  "createdAt": {
    "$date": "2021-03-18T15:42:08.266Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T15:42:11.447Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c20c2e2432a001724efe0"
  }
},{
  "_id": {
    "$oid": "605381e62991100017962414"
  },
  "metas": [],
  "Title": "Arkansas Eviction Laws for Landlords",
  "Content": "**Arkansas Eviction Laws for Landlords**\n<br><br>\nThe Arkansas eviction process is very landlord friendly and aggressive against tenants. There is only a very short time for a tenant to remedy any cause for an eviction. An Arkansas landlord may utilize two different eviction procedures when seeking to evict a tenant if the cause of eviction is for nonpayment of rent: Unlawful Detainer, which is a civil eviction, or Failure to Vacate, which is a criminal eviction.\n<br><br>\nThe Arkansas eviction process is the only one in the United States that makes it a misdemeanor for a tenant to not pay rent if the landlord chooses to evict the tenant via the “failure to vacate” process. Please note that if the eviction is for a violation of lease terms than Failure to Vacate is not an option for a landlord.\n <br><br>\n\n**Legally Valid Reasons to Evict a Tenant in Arkansas**\n<br><br>\nThe legally valid reasons a landlord may evict a tenant in Arkansas include:\n\n<li>If a tenant fails to pay rent in accordance with the written lease agreement.\n<li>If a tenant violates any term or rule stated within the Lease or Rental Agreement.\n<li>If a tenant commits specific criminal acts at the rental property. The criminal acts include illegal gambling, prostitution, and the sale of alcohol without a license.\n<br><br>\n\n**There is No Self-Eviction in Arkansas**\n<br><br>\nA landlord may NOT evict a tenant in the State of Arkansas without an order authorizing an eviction which requires a court hearing by a local judge. Self-eviction includes any action taken by the landlord outside of the normal legal process in Arkansas that is designed to force the tenant to vacate the premises. \n<br><br>\n\n**Arkansas Eviction Notice Requirements**\n<br><br>\nFor nonpayment eviction cases where the landlord chooses the unlawful detainer method of eviction, the Arkansas eviction notice process requires a 3-day Notice to Quit to be served on the tenant by either the landlord or the landlord’s agent. The tenant is only given 3 days to pay the entire rent amount that is outstanding. The date the notice is served counts as the first day.\n<br><br>\nIf the landlord chooses to use the failure to vacate method, which may only be used for cases of nonpayment of rent, the landlord must serve written notice giving the tenant 10 days to comply.\n<br><br>\nIf a landlord wishes to terminate the lease agreement because of material violations of the rental agreement, the landlord must provide the tenant a 14 day notice to comply or to correct the problem. The notice needs to clearly specify the particular lease provision that has been violated and inform the tenant that compliance must be done by a listed date.\n<br><br>\nIf the tenant is accused of breaking the law, the landlord can give the tenant a quit notice with no qualifications.\n<br><br>\nIf there is no written rental agreement, a landlord may terminate the lease at any time and for any reason but must give the tenant one period (normally a month as most are month to month) of advanced notice, called the Arkansas Lease Termination Notice.\n<br><br>\nAny Arkansas eviction notice requirements specified in the written lease agreement must be followed by the landlord and the tenant.\n<br><br>\n\n**Court Actions Required in an Arkansas Eviction**\n<br><br>\nIf the problem tenant has not remedied the situation or removed themselves from the rental unit in the allotted amount of time, then the landlord must file one of two actions against the tenant.\n<br><br>\nIf the eviction is for nonpayment of rent, the landlord may file the civil unlawful detainer case or file the criminal failure to vacate case. A landlord may not file both of these actions against a tenant. If the eviction is for a violation of the lease terms, the landlord may only file an unlawful detainer action.\n<br><br>\n\n**The Two Eviction Options in Arkansas**\n<br><br>\n<u>**Unlawful Detainer**</u>\n<br><br>\nA tenant has five (5) days after being served to file an objection with the court. If the tenant files no objection, the landlord may obtain a Writ of Possession to have the tenant evicted by the sheriff. If the tenant files an objection, the trial continues in two parts.\n<br><br>\n**Summary Proceeding:** If the tenant files an objection within the allotted five (5) days, the court will schedule a summary proceeding where the court determines only which party shall have sole possession of the rental property. The landlord only needs to present a prima facie case that the landlord is entitled to possession due to failure to pay rent or present evidence that substantial damage has occurred at the rental property. \n<br><br>\nThe tenant may present a defense that is in accordance with Arkansas law.\n<br><br>\nIf the court finds that the landlord is likely to be successful in a full Trial on the Merits, the court will issue a Writ of Possession to the landlord. The landlord must post sufficient security, such as a bond, to proceed with the Writ of Possession.\n<br><br>\nIf the tenant has presented a defense that the court agrees with and wants to remain in possession of the rental unit, the tenant must post sufficient security within 5 days after the Writ of Possession is issued. The security may be set at whatever amount the court feels is necessary.\n <br><br>\n\n<u>**Failure to Vacate**</u>\n<br><br>\nIf the landlord has pursued the Failure to Vacate, after the 10 days has lapsed and the rent has not been paid and the tenant has not vacated the property, the landlord may report the tenant to the local prosecutor. \n<br><br>\nThe local prosecutor may charge the tenant with a class B misdemeanor. The criminal action may be classified as more of a minor violation than a criminal offense. Tenants are not subject to imprisonment through the Failure to Vacate action.\n<br><br>\nIf charges are brought against the tenant, the court can impose a fine of $1.00 to $25.00 per day for every day the tenant remains in the rental unit after the 10 days. Some counties in Arkansas rarely use this method of eviction. A judge may dismiss the charges if a tenant agrees to vacate the property immediately.\n<br><br>\n\n**Service of Summons and Tenant Counterclaims**\n<br><br>\nIf the landlord uses the unlawful detainer, or civil method of eviction, the tenant will be served with a Summons and Complaint in Unlawful Detainer once the 3 day or 14 day notice period has expired.  Once served, the tenant only has 5 days to file an objection.\n<br><br>\n\nFor the failure to vacate option, the sheriff or court representative delivers the summons to the tenant.\n<br><br>\n\n**Court Date for Tenant Eviction in Arkansas**\n<br><br>\n<u>**Unlawful Detainer Trial on the Merits**</u>\n<br><br>\nIf the trial makes it past the Summary Proceedings, a full determination regarding rightful possession and any issues of damages is heard by the court.\nIn most cases, this hearing determines the amount of damages owed to the landlord. \n<br><br>\nIf a tenant is able to successfully assert a defense such as self-eviction or the landlord’s failure to make obligated repairs the damages may be assessed against the landlord.\n<br><br>\n<u>**Failure to Vacate**</u>\n<br><br>\nThe court under this method cannot order the tenant to vacate the property though any tenant subject to substantial fines will likely vacate at his or her earliest opportunity.\n<br><br>\nA low-income tenant is not entitled to a public defender in these cases since there is no potential for a sentence of imprisonment.\n<br><br>\nIf a tenant does not show for court, Arkansas courts almost always rule in favor of the landlord.\n<br><br>\n\n**Judgment and Writ of Possession in Arkansas**\n<br><br>\nA Writ of Possession is only issued for Unlawful Detainer cases, not for failure to vacation cases where the tenant will be fined continuously until they vacate the rental property.  In most cases, tenants will not put a bond or post security and will be subject to forcible eviction once the sheriff receives the Writ of Possession and serves it on the tenant.\n",
  "published_at": {
    "$date": "2021-03-18T16:39:18.532Z"
  },
  "createdAt": {
    "$date": "2021-03-18T16:37:58.619Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T16:39:18.650Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  }
},{
  "_id": {
    "$oid": "605383ea2991100017962415"
  },
  "metas": [],
  "Title": "Tennessee Eviction Laws for Landlords",
  "Content": "# Tennessee Eviction Laws for Landlords\n<br>\nIf you are a landlord that owns rental property in the state of Tennessee you'll want to ensure that you understand the real estate law, eviction laws, and the eviction process in the state. Failure to abide by state laws on eviction can result in a lot of legal problems for a landlord and they may have to deal with the problem tenant a lot longer as a result..\n <br><br>\nA portion of the state’s counties are covered by the Uniform Residential Landlord and Tenant Act (URLTA), which has different notice requirements and processes relating to the landlord-tenant relationship. The 10 counties in Tennessee where landlords must abide by the URLTA are Anderson, Blount, Bradley, Davidson, Hamilton, Madison, Montgomery, Shelby, Sumner and Knox.\n <br><br>\n \n**Legally Valid Reasons to Evict a Tenant in Tennessee**\n <br><br>\nThe legally valid reasons a landlord may evict a tenant in Tennessee include:\n <br><br>\n<li>If the tenant fails to pay rent and/or pay rent on time.\n<li>If the tenant has violated the lease or rental agreement.\n<li>If the lease term has ended and the tenant does not move out of the rental unit.\n<li>If the tenant is responsible for noise or safety problems.\n<li>If the tenant is responsible for illegal activity on the rental unit property.\n<li>If the tenant has abandoned the property and therefore the lease.\n<br><br>\n\n**There is No Self-Eviction in Tennessee**\n<br><br>\nA landlord may NOT evict a tenant in the State of Tennessee without an order authorizing an eviction. This requires a court hearing by a local judge. Self-eviction includes any action taken by the landlord outside of the normal legal process in Tennessee that is designed to force the tenant to vacate the premises. \n<br><br>\n \n**Tennessee Eviction Notice Requirements**\n <br><br>\nURLTA Covered Counties in Tennessee\nIn the ten (10) counties that are under the URLTA, a landlord must give a 30-day eviction notice to a tenant who is either behind on rent or who has violated a term of the lease agreement.\n<br><br>\nThe URLTRA covered Tennessee eviction notice must advise the tenant of the exact amount of rent amount owed or the specific lease provision the tenant is in violation of. The notice must also state that the tenant may correct the violation within a 14-day period or the lease will be cancelled in 30-days and legal action will begin.\n<br><br>\nIf it is written in the lease agreement, the notice of rent owed may be implied. An example of this is the lease agreement may state that not paying the rent after a specific date constitutes the 30-day notice to vacate, giving the tenant 30 days to move out of the rental unit.\nIf there is no written lease between the tenant and landlord, the landlord must give 30-days notice to the tenant. The landlord does not need to be given a reason for the eviction. This does not allow the landlord to discriminate against the tenant.\n<br><br>\nIf a tenant remedies the violation only to repeat the identical violation again within 6-months of the initial violation, the landlord must give a 14-day notice to cancel the lease to the tenant. The landlord does not have to give the tenant any ability to remedy the violation in this instance, only the 14 days notice allowance to vacate.\n<br><br>\nNon-URLTA Covered Counties in Tennessee\nFor Tennessee counties not covered by the URLTA, landlords must provide a Tennessee eviction notice of 14-days for failure to pay rent, for tenant-caused property damage, or if health and safety violations have occurred. Violations such as having unapproved tenants or pets require a 30-day written notice to correct the issue or vacate the rental property.\n<br><br>\nIf a  tenant has damaged the rental property in a substantial way, assaulted the landlord or another tenant, has threatened violence, or another person living in the rental property has engaged in behavior that poses a risk to the health and safety of others, the notice period to vacate is 3-days and Landlord must serve a 3 day notice.\n<br><br>\nA lease may contain terms stating that a notice to correct or quit is implied along with what actions would warrant an eviction. A court must consider the terms reasonable and the terms must not waive any legal or constitutional rights of a tenant.\n<br><br>\nAny Tennessee eviction notice may be served by the landlord personally on the tenant, on a co-tenant, by posting it to the door of the rental property or by certified mail.\n<br><br>\nIf a Tennessee Landlord needs to terminate a month to month tenancy agreement the Landlord should serve a Leased Termination Letter.\n <br><br>\n\n**Court Actions Required in an Tennessee Eviction**\n<br><br>\nIf a tenant refuses to correct a lease violation and the tenant does not vacate the property in the allotted time, the landlord must obtain a Detainer Warrant from the General Sessions Court or Circuit Court in the Tennessee county that the rental property is located. \n <br><br>\n\n**Tennessee Eviction Detainer Warrant Actions**\n<br><br>\nThe Detainer Warrant advises the tenant of a court date and time. The court date may not be less than 6 days after the tenant was served, however the parties may request that the trial date be pushed out past this 6 day requirement. \n<br><br>\n\n**Service of Summons and Tenant Counterclaims**\n<br><br>\nLandlords requesting monetary damages along with possession of a rental unit being returned to them must serve the Detainer Warrant to the tenant personally.\n <br><br>\nThe warrant is typically served by the local sheriff or a process server. It may be served personally on the tenant or by posting it on the door of the rental property.\n <br><br>\n\n**Court Date for Tenant Eviction in Tennessee**\n<br><br>\n \nAn eviction hearing is a trial before a judge. The tenant’s failure to appear on that day will result in a default judgment for the landlord. The landlord has the burden of proving that the tenant did not pay the rent when due or that he or she violated a specific rule or term within the lease agreement.\n<br><br>\nProper notice must also be proved. Evidence may be presented by providing copies of the lease, notice provided and proof of service, rent receipts, repair estimates, police reports, or witness testimony.\n<br><br>\n\n**Judgment and Writ of Possession in Tennessee**\n<br><br>\nIf the landlord is granted possession by the court through winning a trial or due to the tenant not showing, the tenant will be given 10-days to vacate the rental property. The tenant has the right to appeal the court ruling within the 10-day period to vacate.\n<br><br>\nIf the tenant has not vacated after 10-days, the landlord may request the court issue a Writ of Possession. The Writ of Possession gives the sheriff the legal right to remove the tenant’s property without notice to the tenant on the 11th business day after the order is issued by the court.\n<br><br>\nThe sheriff does not actually remove the tenant’s possessions, instead supervising the event and ensures the peace. The landlord or the landlord's representatives must remove the tenant's possessions from the rental unit.\n \n \n \n \n\n",
  "published_at": {
    "$date": "2021-03-18T16:46:36.768Z"
  },
  "createdAt": {
    "$date": "2021-03-18T16:46:34.415Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T16:46:36.804Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c202fe2432a001724efda"
  }
},{
  "_id": {
    "$oid": "6053957133690d00173b540f"
  },
  "metas": [],
  "Title": "Iowa Eviction Laws for Landlords",
  "Content": "# Iowa Eviction Laws for Landlords\n<br>\nIn Iowa evictions, the courts deal with the tenant removal from the property aspect and the rent money owed aspect differently. A landlord needs to be thoughtful when requesting an eviction and money damages all at once as it may allow the tenant a longer time period to correct the issue and delay the eviction action.\n<br><br> \nIt's important for an Iowa landlord to be aware of the necessary steps in the Iowa eviction process. A landlord in Iowa that tries to force a tenant out of a rental property on their own not utilizing the legal process may end up being ordered to pay material money damages to a tenant.\n<br><br>\n \n**Legally Valid Reasons to Evict a Tenant in Iowa**\n<br><br>\nIn Iowa, a landlord may evict a tenant for the following reasons:\n<br><br>\n<li>The tenant failing to pay the rent.\n<li>The tenant does not comply with a material term within the lease or rental agreement. \n<li>The tenant commits an ongoing nuisance or presents a clear and present danger to other tenants or the landlord.\n <br><br>\n\n**There is No Self-Eviction in Iowa**\n<br><br>\nA landlord may NOT evict a tenant in the State of Iowa without an order from a court authorizing an eviction. Self-eviction includes any action taken by the landlord outside of the normal legal process designed to force the tenant to vacate the premises.\n \n**Iowa Eviction Notice Requirements**\n<br><br>\n<u>Payment of Rent Issue</u>\n<br><br>\nThe eviction notice required in Iowa for nonpayment of rent is 3 days. The written notice needs to advise the tenant of the total amount of rent due including any other fees such as late fees. The notice must also state that the lease will be terminated unless payment is made within 3 days after the notice is served to the tenant. The notice may be served the day after rent is due and the day the notice is served is not included in the compliance period.\n<br><br>\nUnder Iowa law, a landlord may accept a partial rent payment. The landlord must provide in writing to the tenant a time period in which to pay the remainder of rent due. If the tenant fails to pay the partial rent due amount by the end of the stated time period, the landlord may proceed with the next step in the Iowa eviction process. No additional eviction notice is required to proceed to the eviction.\n<br><br>\nIf a tenant was given a 3-Day Notice to Quit for nonpayment of rent in the past, the landlord is not required to allow the tenant to pay the entire amount due within the 3 days. The tenant may move forward with the eviction process immediately.\n <br><br>\n<u>Clear and Present Danger to Landlord to Tenant</u>\n <br><br>\nA \"clear and present danger\" include provable threats of violence against the landlord or other tenants, an illegal use of a firearm or another weapon, or possession of illegal drugs. A landlord in Iowa must prove the “clear and present danger” through affidavits from witnesses to the event. A police report verifying the event in question may be enough for a court to declare a \"clear and present danger.\"\n <br><br>\nA tenant that has caused a \"clear and present danger\" only receives 3 days notice to quit the rental property. The \"clear and present danger\" notice informs the tenant that no correction of the issue is possible and he or she must vacate the property.\n<br><br>\n<u>Violation of Lease Agreement Term</u>\n<br><br>\nWhere the reason for the eviction is other than nonpayment of rent or for presenting a clear and present danger, the Iowa eviction notice is a 7 Day Eviction Notice. This notice must state the specific lease provision that has been violated and that the tenant may cure the violation such as by paying for damages caused by the tenant or by removing unauthorized pets or tenants within the 7 day period or the lease will be terminated.\n <br><br>\n\n<u>Month to Month Tenancies</u>\n <br><br>\nWhen a landlord and tenant have a month-to-month lease agreement, the landlord must only give a 30-day notice of eviction. No legally valid reason is needed for the eviction for a month to month tenancy.\n <br><br> \n\n**Service of Notice of Eviction**\n <br><br>\nThe landlord or representative may serve an Iowa eviction notice by:\n <br><br>\n<li>Delivering the notice to the tenant in person.\n<li>Delivering it to an adult living in the rental property and obtaining a signature from the adult confirming receipt of the eviction notice.\n<li>By posting the notice on the unit door, sending the notice by certified mail, and sending the notice by regular mail. If notice is served via door and mail, the notice period starts 4 days after the mail has been postmarked.\n <br><br>\n\n**Court Actions Required in an Iowa Eviction**\n<li>\nIf the tenant does not pay the total rent due, vacate the rental property, or correct the lease or rental agreement violation, the  landlord must being a court action called Forcible Entry and Detainer. This is a legal action for possession of the rental unit only. The landlord needs to initiate a separate legal action to recover any damages or rent owed from the tenant.\n<br><br>\n<li>A landlord that brings a Forcible Entry and Detainer must be careful in what the suit alleges. If the landlord is alleging damages in the Forcible Entry and Detainer, the tenant can request that the action be treated as a money judgment. This can slow the eviction process considerably.\n <br><br>\n\n**Iowa Eviction Forcible Entry and Detainer Actions**\n<br><br>\nThe landlord will need to present a copy of the served notice and a return of service to the court clerk before filing the Forcible Entry and Detainer. A court will throw out a case where a tenant has not been properly served under the Iowa code of law.\n <br><br>\n\n**Service of Summons and Tenant Counterclaims**\n<br><br>\nThe tenant is given at least 3 full days between the service of the action and the hearing date.\nIf money damages are requested, the answer from the tenant to the charge is extended to 20 days after service of the Forcible Entry and Detainer with a hearing scheduled several weeks later. \n<br><br>\n \n**Court Date for Tenant Eviction in Iowa Hearing**\n<br><br>\nIf the tenant does not appear in court, the landlord can gain immediate possession of the property after waiting 3 days and obtaining a Writ of Removal from the court to be served on the tenant.\n<br><br>\nIf a tenant appears in court and offers to pay the rent in full, the landlord may accept it and dismiss the action. The landlord may also continue to pursue the eviction.\n<br><br>\n\n<u>Stipulated Forcible Entry and Detainer</u>\n\nThe landlord and the tenant may enter into a stipulated Forcible Entry and Detainer. In this situation, a new hearing date is scheduled to allow the tenant additional time to pay what is owed or to correct the lease violation. If the tenant fails to correct the eviction reason, the landlord is granted immediate possession by the court.\n<br><br>\n\n<u>Hearing for Monetary Damages in Iowa</u>\n<br><br>\nIf the Forcible Entry and Detainer excluded monetary demands, the landlord can obtain a judgement for monetary damages. The landlord must file a suit in small claims court if the amount is below a certain level or in District Court if the alleged damages exceeds the small claims court maximum amount.\n<br><br>\nA landlord can serve the tenant with a separate monetary damages action along with the Forcible Entry and Detainer action. The tenant is given 20 days to file a legal answer to the damages lawsuit or lose the lawsuit.  \n<br><br>\n \n**Judgment, Order of Possession, and Writ of Removal in Iowa**\n<br><br>\nIf the landlord wins the Forcible Entry and Detainer case, the court will issue an Order of Possession and the tenant must vacate the property. If the tenant does not vacate the rental unit within 3 days, the landlord must obtain the Writ of Removal from the court.\n<br><br>\nThe Writ of Removal is then provided to the local sheriff for delivery to the tenant. The sheriff will return and remove the tenant’s possessions and the tenant if the tenant is not out of the rental property by the stated date.\n <br><br>\nIowa landlords may benefit from seeking legal advice if they are unclear on any aspect of the eviction process in the state.\n",
  "published_at": {
    "$date": "2021-03-18T18:02:25.413Z"
  },
  "createdAt": {
    "$date": "2021-03-18T18:01:21.281Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T18:02:25.431Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "category": {
    "$oid": "608c204ce2432a001724efdb"
  }
},{
  "_id": {
    "$oid": "6053970c33690d00173b5410"
  },
  "metas": [],
  "Title": "Oklahoma Eviction Laws for Landlords",
  "Content": "# Oklahoma Eviction Laws for Landlords\n<br><br>\nIf you are a landlord that owns rental property in the state of Oklahoma you'll want to ensure that you understand the eviction laws in the state before proceeding with an eviction. Failure to abide by state laws on eviction can result in a lot of legal problems for a landlord as well as a problem tenant that remains in their rental property.\n<br><br> \nThe Oklahoma eviction process provides an expedited procedure to remove a tenant for 3 major reasons. A landlord may not force a tenant to vacate without first serving the proper Oklahoma eviction notice and by obtaining a court order to do so.\n <br><br>\n\n**Legally Valid Reasons to Evict a Tenant in Oklahoma**\n<br><br>\nA landlord may evict a tenant in Oklahoma for the following legally valid reasons :\n<br><br>\n<li>For the nonpayment of rent.\n<li>For staying in the rental property after the expiration of the lease term, called a holdover.\n<li>For a violation of a material term of the lease agreement or rental agreement.\n<br><br>\n\n**There is No Self-Eviction in Oklahoma**\n<br><br>\nA landlord may NOT evict a tenant in the State of Oklahoma without an order authorizing an eviction which requires a court hearing. Self-eviction includes any action taken by the landlord outside of the normal legal process designed to force the tenant to vacate the premises. In Oklahoma, a tenant can obtain injunctive relief from a court ordering the landlord to stop any illegal acts to remove them. \n <br><br>\n**Oklahoma Eviction Notice Requirements**\n<br><br>\nFor nonpayment of rent situations, a landlord needs to first serve a 5-day notice to quit the rental property. This notice advises the tenant of the total rent amount due and that it must be paid in full within the 5-day period or the landlord will begin legal action to evict the tenant. The tenant may also avoid the legal eviction by vacating the property.\n <br><br>\nLease term violations besides the tenant's failure to pay the rent require a 10-Day eviction notice that the landlord must provide the tenant. This notice must state the lease term that  that was violated and that the lease will terminate in 15-days unless the lease term being violated is corrected within 10-days.\n<br><br>\nA landlord may enter the premises after 10-days to repair the property that is the subject of the eviction or lease violation. And then the landlord may submit the repair costs to the tenant as rent on the next rental due date or for the reasonable value of the repairs along with the rent. The eviction may not go forward if this action is taken.\n<br><br>\nIf the tenant has materially damaged the rental property or has or is causing immediate and irremediable harm to the property or others and fails to quickly correct the violation after receiving reasonable notice to do so, the landlord may immediately begin a forcible entry and detainer action against the problem tenant.\n<br><br>\nFor month-to-month tenancies, the law in Oklahoma requires 30-days notice before filing for an unlawful detainer. This allows the tenant 30 days to vacate the rental property.\n<br><br>\nService of the notice to quit the rental property may be personally served on the tenant or on a person who is over the age of 12 that has been informed of the nature and intent of the eviction notice. As an alternative option, the notice may be posted in a highly visible place such as a front door but it must also sent by registered mail.\n<br><br> \n\n**Court Actions Required in an Oklahoma Eviction**\n<br><br>\nIf a landlord has provided written notice to a tenant to vacate the property and the tenant has done so and has also not corrected the reason for eviction, the tenant must file a lawsuit with the local court.\n<br><br>\nA landlord needs to file a Summons and Complaint in Forcible Entry and Detainer with the local court to move the eviction action forward. \n <br><br>\n**Oklahoma Eviction Unlawful Detainer Actions**\n<br><br>\nIn Oklahoma, a landlord may demand damages as a part of the unlawful detainer. Past due rent, costs of repair to a rental property due to tenant acts, court costs, and attorney’s fees are all claims a landlord can make against a tenant in Oklahoma. Please note that in Oklahoma, the landlord may only collect monetary damages through an unlawful detainer action if the tenant is served a summons in person.\n <br><br>\n\n**Service of Summons and Tenant Counterclaims**\n<br><br>\nAn unlawful detainer summons is served to a tenant by a process server or local sheriff 3 days or more in advance of the court hearing on the eviction case.\n <br><br>\nIf the tenant has any viable defenses or counterclaims against the landlord in the eviction action, he or she is required file and serve a written legal answer to the landlord's claims before the court date. A landlord or a tenant may request a jury trial. A jury trial is typically less favorable for a landlord so avoiding this may be in a landlord's best interest.\n <br><br>\n**Court Date for Tenant Eviction in Oklahoma**\n<br><br>\nIf the landlord and the tenant appear in court the judge will work towards the two parties finding an acceptable settlement if one is possible. The hearing will begin with the landlord 's burden of proving the breach was extensive enough to justify the the eviction.\n<br><br>\nProof of service to the problem tenant of the proper notice giving the legally proper amount of time to the tenant to vacate or correct is expect of the landlord as well. The tenant may present any defenses or counterclaims after the landlord is done presenting his or her case against the tenant.\n <br><br>\n\n**Judgment and Writ of Execution in Oklahoma**\n<br><br>\nIf the landlord prevails in court and is granted possession of their rental property, the court will issue a Writ of Execution for the landlord. The tenant then has 2-days to leave the property or the landlord may present the Writ to the sheriff to execute and to remove the tenant and their personal property from the rental property.\nIn Oklahoma, the landlord may also have a lien on the tenant’s property. This lien allows them the ability to sell the items if 10-days notice is provided to the tenant via registered or certified mail.\n<br><br>\nIf you do not feel comfortable pursuing an eviction without legal advice in Oklahoma, digpads recommend you contact a competent attorney that practices legally in the State.\n \n",
  "published_at": {
    "$date": "2021-03-18T18:08:15.662Z"
  },
  "createdAt": {
    "$date": "2021-03-18T18:08:12.427Z"
  },
  "updatedAt": {
    "$date": "2021-03-18T18:08:15.703Z"
  },
  "__v": 0,
  "created_by": {
    "$oid": "603ae586d02d220017b03aaf"
  },
  "updated_by": {
    "$oid": "603ae586d02d220017b03aaf"
  }
}]